<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-874" />
<title>Untitled Document</title>
</head>

<body>
<p>ยินดีต้อนรับสู่ระบบประเมิณภาระงาน TOR</p>
 <strong>
<!-- table width="500" border="0" cellpadding="5" cellspacing="1" bgcolor="#CCCCCC">
  <tr>
    <td align="left" bgcolor="#FFFFFF"> <font color="#0066CC"> การจัดทำกรอบภาระงานของมหาวิทยาลัย เกิดจากแนวคิดเชิงพัฒนาที่ต้องการพัฒนามหาวิทยาลัยให้มีระบบบริหารจัดการที่ดี มีประสิทธิภาพ สามารถตรวจสอบได้ และสิ่งที่สำคัญยิ่ง คือ การให้ทุกคนมีส่วนร่วมในการพัฒนามหาวิทยาลัยตามวิสัยทัศน์ของมหาวิทยาลัยภายใต้แนวคิดที่ว่า “มหาวิทยาลัยต้องมีระบบประเมินที่ดี สร้างแรงจูงใจและยกระดับสิทธิประโยชน์ของบุคลากรทั้งองค์กร เพื่อรักษาคนดี เสียสละ และรักในองค์กร เพื่อบุคลากรทั้งองค์กรมีความเจริญก้าวหน้า              ในหน้าที่การงานเป็นที่ยอมรับทั้งภายในและภายนอก </font> </td>
  </tr>
</table-->
</strong></p><strong>
<table width="500" border="0" cellpadding="5" cellspacing="1" bgcolor="#CCCCCC">
  <tr>
    <td align="left" bgcolor="#FFFFFF"> <font color="#0066CC"> การจัดทำกรอบภาระงานของมหาวิทยาลัย เกิดจากแนวคิดเชิงพัฒนาที่ต้องการพัฒนามหาวิทยาลัยให้มีระบบบริหารจัดการที่ดี มีประสิทธิภาพ สามารถตรวจสอบได้ และสิ่งที่สำคัญยิ่ง คือ การให้ทุกคนมีส่วนร่วมในการพัฒนามหาวิทยาลัยตามวิสัยทัศน์ของมหาวิทยาลัยภายใต้แนวคิดที่ว่า “มหาวิทยาลัยต้องมีระบบประเมินที่ดี สร้างแรงจูงใจและยกระดับสิทธิประโยชน์ของบุคลากรทั้งองค์กร เพื่อรักษาคนดี เสียสละ และรักในองค์กร เพื่อบุคลากรทั้งองค์กรมีความเจริญก้าวหน้า              ในหน้าที่การงานเป็นที่ยอมรับทั้งภายในและภายนอก </font> </td>
  </tr>
</table>
</strong></p>
<br />
เกรียงไกร นามพุทธา<br />
ผู้พัฒนาระบบ<br />
ภายในกด 1177
</body>
</html>
