<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-874" />
<title>Untitled Document</title>
</head>

<body>
<table border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="left"><br />
<table width="800" border="0" cellpadding="0" cellspacing="10">
      <tr>
        <td align="left" valign="top"><table border="0" cellpadding="10" cellspacing="1" bgcolor="#666666">
          <tr>
            <td bgcolor="#000000"><strong><font color="#FFFF00">ข่าวประชาสัมพันธ์</font></strong></td>
          </tr>
          <tr>
            <td bgcolor="#FFFFFF"><!--p>-<font color="#0033FF">***หลักฐานโครงการต่างๆสามารถเข้าไปโหลดได้ที่ <strong><a href="http://202.28.32.130/evaluation/docs/5556/sum257.php" target="_blank">สรุปโครงการ     ใช้ในการประเมิน วงรอบที่ 2 (1 มีนาคม พ.ศ. 2557 ถึง 31 สิงหาคม พ.ศ. 2557</a></strong></font></p-->
              <p><font color="#0033FF">การประเมินผลการปฏิบัตราชการของบุคลากร คณะวิทยาศาสตร์ วงรอบที่ 1 ระหว่างวันที่ 1 มีนาคม - 31 สิงหาคม 2567     </font>              </p>
              <p><strong>-แจ้งเรื่องที่ 6 </strong><font color="red" size="5">ฟังก์ชั่นในการพิมพ์รายงานจะกลับมาใช้งานได้อีกครั้งในวันพรุ่งนี้ (23 ก.พ. 65)10.00นเป็นต้นไป ขออภัยในความไม่สะดวก<br />
              </font><strong>-แจ้งเรื่องที่ 5 </strong><font color="red" size="5">เนื่องจากพบปัญหาในการคำนวณค่าภาระงานทำให้ต้องปิดฟังก์ชั่นในการพิมพ์รายงานชั่วคราว เพื่อตรวจสอบความถูกต้อง ผู้ดูแลระบบต้องขออภัยในความผิดพลาดที่เกิดขึ้นจะแจ้งความคืบหน้าให้ทราบอีกครั้งครับ<br />
              </font>`</p>
              <p><strong></strong><strong>-แจ้งเรื่องที่ 4 </strong><font color="red" size="3">ไฟล์หลักฐานที่ใช้ในการอัพโหลด<font size="5">จำกัดขนาดไม่เกิน 10 MByte ต่อ 1 ไฟล์</font></font></p>
              <p><strong></strong></p>
              <p><strong>-แจ้งเรื่องที่ 3</strong> <a href="http://202.28.32.138/tci/tci1.pdf" target="_blank">รายชื่อวารสารที่ผ่านการรับรองคุณภาพจากTCI (กลุ่มที่1) </a><br />
                <a href="http://202.28.32.138/tci/tci2.pdf"  target="_blank">รายชื่อวารสารที่ผ่านการรับรองคุณภาพจากTCI (กลุ่มที่2) </a></p>
              <p><strong>-แจ้งเรื่องที่<strong><font color="#cc0000"> 2. </font></strong></strong>ตรวจสอบข้อมูลรายวิชาและหลักฐาน ได้ที่ <a href="http://202.28.32.130/scitqf/" target="_blank">ระบบจัดเก็บข้อมูล มคอ. </a> <strong><font color="#CC0000">หากไม่พบรายวิชาของท่าน  ให้ท่านตรวจสอบสถานะใน<a href="http://202.28.32.130/scitqf" target="_blank">ระบบ บันทึกข้อมูล มคอ </a> ว่ามีอยู่หรือไม่  หากมีข้อสงสัยเกี่ยวกับรายวิชา ให้สอบถามไปยัง นางสาวบุษยา มูลศรีแก้ว<br />
                นักวิชาการศึกษา<br />
                เบอร์ภายใน .1518</font></strong><br />
              </p>
              <p><strong>-แจ้งเรื่องที่<strong><font color="#cc0000"> 1. </font></strong></strong><font color="#CC0000"><strong>การสำรองข้อมูลเพื่อป้องกันข้อมูลเสียหาย</strong></font> ผู้ดูแลระบบจะมีการสำรองข้อมูล สัปดาห์ละ 1 ครั้งคือทุกวันพุธ เวลา 17.00 น. ทุกสัปดาห์จนกว่าปิดระบบ </p>
              <p>หากมีข้อสงสัยสอบถามได้ที่ LINEID : siamidea<br />
              <!--strong>-แจ้งเรื่องที่ 5 </strong><strong> </strong> <font  color=red size=5 >การเปิดรระบบครั้งนี้ ค่าเริ่มต้นระบบจะเพิ่มรายวิชาทั้งภาคบรรยาและปฏิบัติอัตโนมัติ โดยดึงจากระบบ SCITQF ที่ตรงกับรอบการประเมินปัจจุบัน </font><br />
              <strong><br />
              -แจ้งเรื่องที่ 6 </strong><strong> </strong> <font  color="red" size="5" >ขยายเวลาในการปิดระบบการกรอก ป 01 จากเดิมวันที่ 7 ธันวาคม 2561 เวลา 23.59น เป็นวันที่ 16 ธันวาคม 2561 เวลา 23.59น   </font><a href="docs/38676.jpg" target="_blank"><img src="docs/google_docs.png" width="18" height="18" /></a><br /-->
<br /> 
              <img src="http://202.28.32.138/eoffice/data/file_document/127934.jpg" width="142" height="142" /><br />
              </p>
              <p><font color="#0000FF">เกรียงไกร นามพุทธา<br />
                ผู้พัฒนาระบบ<br />
                เบอร์ภายในกด 1177 </font></p></td>
          </tr>
          <tr>
            <td bgcolor="#FFFFFF">&nbsp;</td>
          </tr>
        </table>
          <p>&nbsp;</p>          </td>
        </tr>
    </table>
      <p>

	  <!--br />
        <font color="ff0000" >เรียน อาจารย์ผู้ใช้ระบบทุกท่าน ในขณะนี้ได้มีการเปลี่ยนแปลงข้อมูลให้ระบบบางส่วน ซึ่งรายละเอียดดังนี้<br />
        5.5 	จิตอาสาอื่นๆ<br />
        5.6 	การเข้าร่วมกิจกรรมอื่นๆ <br />
        5.7 	อื่นๆ <br />
        ยุบรวมกันเป็น <strong>5.5 	การเข้าร่วมกิจกรรมอื่นๆ </strong> ข้อเดียว <br />
        สูตรและตัวแปรของทั้ง 3 หัวข้อ เป็นตัวเดียวกัน ดังนั้นจึงสามารถรวมกันได้โดยที่อาจารย์ผู้กรอกแบบ ป.01 ในส่วนนี้ไม่ต้องเข้าไปเปลี่ยนแปลง แต่อย่างใด<br />
        <strong>จึงเรียนมาเพื่อทราบและขออภัยในความไม่สะดวกอีกครั้ง</strong> (03/08/2013 เวลา 16.30 น.)<br />
        </font></p>
      <p><font color="ff0000" >เรียน อาจารย์ผู้ใช้ระบบทุกท่าน ในขณะนี้ได้มีการเปลี่ยนแปลงข้อมูลให้ระบบบางส่วน ซึ่งรายละเอียดดังนี้<br />
        1. หัวข้อ 3.4) งานบริการวิชาการให้แก่หน่วยงานภายนอก (เดิม) ได้พิจารณาตัดออกจากระบบ แล้วเปลี่ยนเป็นหัวข้อ 3.4) งานบริการวิชาการรับเชิญเป็นผู้ทรงคุณวุฒิ<br />
  &nbsp;&nbsp;ดังนั้น ข้อมูลที่มีการกรอกในหัวข้อ 3.4 (เดิม)ก่อนหน้านี้ (02/08//2013 19.00 น.) จะไม่ปรากฎในระบบ<br />
  &nbsp;&nbsp;อาจารย์ผู้กรอกในหัวข้อ 3.4 เดิม โปรดทำการตรวจสอบและทำการเพิ่มข้อมูลเข้าไปใหม่<br />
        2. ในหัวข้อ  5.1 และ 5.2 ได้ปรับเปลี่ยนตัวคูณใหม่ดังนี้<br />
        ตัวคูณ=1 หลักสูตรผ่านการประเมินตามกรอบมาตรฐาน TQF<br />
        ตัวคูณ=2 มี มคอ. 3, 5 ครบทุกรายวิชาที่เปิดสอน<br />
        ตัวคูณ=3 มีการประเมินหลักสูตรอย่างน้อยตามกรอบเวลาที่กำหนดในเกณฑ์มาตรฐานหลักสูตรฯ <br />
        ตัวคูณ=4 มี มคอ. 7 ตามเวลาที่กำหนด<br />
        ตัวคูณ=5 มีการพัฒนาและปรับปรุงหลักสูตรอย่างต่อเนื่อง<br />
        ฉะนั้นโปรดตรวจสอบดูตัวคูณในหัวข้อดังกล่าวอีกครั้ง<br />
  <strong>จึงเรียนมาเพื่อทราบและขออภัยในความไม่สะดวกครับ</strong> (02/08/2013 เวลา 20.15 น.)<br />
        <br />
        <br />
        - ประกาศขยายเวลาการกรอก แบบ ป.01 ถึง <strong><font size=5 > วันที่ 9 สิงหาคม 2556 </font></strong>เนื่องจากมีการเปลี่ยนแปลงข้อมูลบางส่วน<br />
        ซึ่งจะมีการเจ้งรายละเอียดการเเปลี่ยนแปลงให้ทราบอีกครั้ง 
        เพื่อให้อาจารย์ที่กรอกข้อมูลทำการตรวจสอบ
        และแก้ไขในกรณีที่ข้อมูลของท่านไม่ถูกต้อง<br />
        <strong>จึงเรียนมาเพื่อทราบและขออภัยในความไม่สะดวกครับ</strong> (02/08/2013 เวลา 10.20 น.)<br />
        <br />
             </font>  <br />
        <br />
        <font color="008800" >
        - เนื่องจากมีข้อผิดพลาดในข้อ 3.5) งานบริการวิชาการรับเชิญรายบุคคลจากหน่วยงานภายนอก<br />
        ซึ่งสาเหตุเกิดจากความผิดพลาดในการเขียนโปรแกรม ช่องให้กรอกจำนวนชั่วโมงหายไป<br />
        ขณะนี้ได้มีการแก้ไขเรียบร้อยแล้ว รบกวนอาจารย์ทุกท่านที่ได้กรอกข้อมูลข้อ 3.5 ทำการตรวจสอบและระบุจำนวนชั่วโมงด้วยครับ<br />
  <strong>ต้องขออภัยด้วยครับ</strong> (30/7/2013 เวลา 20.00 น.)
  <br />
  <br />
        - เรียนคณาจารย์ทุกท่าน เนื่องจากข้อมูลที่กรอกเป็น แบบ ป.01 จะแนบไฟล์หลักฐาน หรือ <strong>ไม่แนบ</strong> ไฟล์หลักฐาน  ก็ได้ <br />
        เพราะหลักฐานสามารถเพิ่มเติมในการกรอก แบบ ป.03 ช่วงปลายเดือนสิงหาคม จึงเรียนมาเพื่อทราบ ขอบคุณครับ
        <br />
        - และ โครงการต่างๆ ไม่จำเป็นต้องแนบหลักฐาน ให้ส่งหลักฐานทั้งหมดไปที่ คุณ เสาวนีย์ รัตนวัน (สำนักงานเลขานุการคณะวิทยาศาสตร์) <br />
        เพื่อเก็บหลักฐานเพื่อใช้ประกอบการประเมิน  <br />
  <br />
        - ระบบประเมินภาระงานจะเปิดให้กรอกข้อมูลแบบ ป.01 และ ป.02 ในรอบ 2 ประจำปี 2556 ในวันที่ 29 กรกฎาคม 2556 จนถึงวันที่ 2 สิงหาคม 2556 </font>
        <br />
        <font color="0000ff" >- <strong><font color="008888" ><u>Backup</u></font> </strong>ในระหว่างวันที่ 29 กรกฎาคม 2556 จนถึงวันที่ 2 สิงหาคม 2556 ผู้ดูแลระบบจะมีการ Backup ข้อมุลทุกวัน เพื่อความปลอดภัยของข้อมูล</font>      </p-->
	  <br />
        <!-- table width="500" border="0" cellpadding="5" cellspacing="1" bgcolor="#CCCCCC">
  <tr>
    <td align="left" bgcolor="#FFFFFF"> <font color="#0066CC"> การจัดทำกรอบภาระงานของมหาวิทยาลัย เกิดจากแนวคิดเชิงพัฒนาที่ต้องการพัฒนามหาวิทยาลัยให้มีระบบบริหารจัดการที่ดี มีประสิทธิภาพ สามารถตรวจสอบได้ และสิ่งที่สำคัญยิ่ง คือ การให้ทุกคนมีส่วนร่วมในการพัฒนามหาวิทยาลัยตามวิสัยทัศน์ของมหาวิทยาลัยภายใต้แนวคิดที่ว่า “มหาวิทยาลัยต้องมีระบบประเมินที่ดี สร้างแรงจูงใจและยกระดับสิทธิประโยชน์ของบุคลากรทั้งองค์กร เพื่อรักษาคนดี เสียสละ และรักในองค์กร เพื่อบุคลากรทั้งองค์กรมีความเจริญก้าวหน้า              ในหน้าที่การงานเป็นที่ยอมรับทั้งภายในและภายนอก </font> </td>
  </tr>
</table -->
      <p>&nbsp;</p>
    <p>&nbsp;</p></td>
  </tr>
</table>
</body>
</html>
