<div align="center">
  <p><strong>กำหนดการ ประจำปี 2565</strong><br />
    การประเมินผลการปฏิบัติราชการของบุคลากร คณะวิทยาศาสตร์<br />
  วงรอบที่ 1 ระหว่างวันที่ 1 มีนาคม - 31 สิงหาคม 2567</p>
  <table border="0" cellspacing="0" cellpadding="5" id="customers02">
    <tr>
      <th width="10%"><div align="center">ลำดับที่</div></th>
      <th width="40%"><div align="center">วัน/เดือน/ปี</div></th>
      <th width="50%"><div align="center">การดำเนินงาน</div></th>
    </tr>
    <tr>
      <td><div align="center">1</div></td>
      <td>วันที่ 20 พฤษภาคม 2565 &ndash; <br />
วันที่ 30 มิถุนายน 2565<br /></td>
      <td>บุคลากรกรอกข้อมูลในระบบประเมิน เพื่อจัดทำ ป.01 ป.02</td>
    </tr>
    <tr>
      <td><div align="center">2</div></td>
      <td>วันที่ 1 กรกฎาคม 2565 &ndash; วันที่  21 สิงหาคม 2565 <br /></td>
      <td>บุคลากรกรอกข้อมูลในระบบประเมิน เพื่อจัดทำ  ป.03</td>
    </tr>
    <tr>
      <td><div align="center">3</div></td>
      <td> วันที่  22 สิงหาคม  2565          เวลา 09.00 น. <br /></td>
      <td>ประชุมคณะกรรมการตรวจหลักฐานการ ประเมินระดับคณะ ครั้งที่ 1 </td>
    </tr>
    <tr>
      <td><div align="center">4</div></td>
      <td> วันที่  22-28 สิงหาคม  2565 </td>
      <td>คณะกรรมการตรวจหลักฐานการประเมินระดับภาควิชา พิจารณาตรวจสอบหลักฐานการประเมิน และดำเนินการจัดทำ  ป.04 </td>
    </tr>
    <tr>
      <td><div align="center">5</div></td>
      <td>วันที่  29 สิงหาคม 2565<br /><br /></td>
      <td>ภาควิชาจัดส่งผลการประเมินบุคลากร ทุกระดับ<br />
        ที่งานบุคคลเพื่อเสนอคณะกรรมการตรวจหลักฐานการประเมินระดับคณะ</td>
    </tr>
    <tr>
      <td><div align="center">6</div></td>
      <td>วันที่ 30 สิงหาคม 2565 เวลา 13.00 น. </td>
      <td>ประชุมคณะกรรมการตรวจหลักฐานการ ประเมินระดับคณะ ครั้งที่ 2 </td>
    </tr>
    <tr>
      <td><div align="center">7</div></td>
      <td>วันที่  31 สิงหาคม 2565  - วันที่ 4 กันยายน 2565 </td>
      <td>คณะกรรมการตรวจหลักฐานการประเมินระดับคณะส่งผลการประเมินกลับภาควิชาเพื่อให้บุคลากรลงลายมือชื่อ รับทราบผลการประเมิน</td>
    </tr>
    <tr>
      <td><div align="center">8</div></td>
      <td>วันที่  5 กันยายน  2565</td>
      <td>ภาควิชาส่งผลการประเมินที่งานบุคคล พร้อมส่งแบบการประเมิน ป.01-ป.04</td>
    </tr>
    <tr>
      <td><div align="center">9</div></td>
      <td>วันที่ 6-8 กันยายน 2565</td>
      <td>สรุปแบบประเมิน/ตรวจสอบความถูกต้อง</td>
    </tr>
    <tr>
      <td><div align="center">10</div></td>
      <td>วันที่ 9 กันยายน  2565 เวลา 13.00 น. </td>
      <td>ประชุมคณะกรรมการกลั่นกรองระดับคณะ</td>
    </tr>
    <tr>
      <td><div align="center">11</div></td>
      <td>วันที่  12-13 กันยายน  2565</td>
      <td>คณบดีลงนาม ป.04 </td>
    </tr>
    <tr>
      <td><div align="center">12</div></td>
      <td>วันที่ 14 กันยายน  2565<br />
      วันที่ 15 กันยายน 2565<br /></td>
      <td>ตรวจสอบความถูกต้อง/จัดเก็บสำเนาแบบประเมิน ส่งกองการเจ้าหน้าที่ เพื่อเสนอ ก.บ.ม. </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <p><br />
  </p>
</div>
<p>&nbsp;</p>
