<?php
$q[1] = "ความสะดวกในการเข้าใช้งานระบบ" ;
$q[] = "การเข้าสู่ระบบ (Login) สะดวก รวดเร็ว" ;
$q[] = "ความสะดวกในการเลือกใช้เมนูหรือปุ่มคำสั่ง" ;
$q[] = "การจัดสีสัน และรูปแบบจอภาพเหมาะสม" ;
$q[] = "ขนาดของตัวอักษรชัดเจนอ่านง่าย" ;
$q[] = "รูปแบบและความสะดวกในการใช้งานระบบ" ;
$q[] = "ระบบสามารถช่วยให้การปฏิบัติงานสะดวกรวดเร็วขึ้น" ;
$q[] = "คู่มือในการใช้งานระบบเข้าใจง่าย ชัดเจน" ;
$q[] = "ระบบสามารถนำไปใช้งานได้จริง" ;
$q[] = "สรุปโดยภาพรวมของระบบ" ;

$newtype[1]="ข่าวประชาสัมพันธ์";
$newtype[]="ข่าวอบรม";
$newtype[]="ข่าวรับสมัครงาน";
$newtype[]="ข่าวประกวดราคา";


$searchfields[]="ทุกเขตข้อมูล";
$searchfields[]="ชื่อเรื่อง";
$searchfields[]="ถึงหน่วยงาน";
$searchfields[]="จากหน่วยงาน";
$searchfields[]="ที่หนังสือ(ศธ.)";
$searchfields[]="วันที่/เดือน/ปี ที่บันทึก";


$newoption[1]="default";
$newoption[]="New";
$newoption[]="Update";
$newoption[]="Hot";

$status_doc[]="";
$status_doc[]="เกษียนหนังสือ";
$status_doc[]="ส่งถึงผู้รับ";
$status_doc[]="รับฉบับจริง";

$grouplevel[1]="Administrator";
$grouplevel[2]="งานสารบรรณ";
$grouplevel[3]="บุคลากร";





$level[]="";
$level[]="คณบดี";
$level[]="รองคณบดี";
$level[]="เลขานุการคณบดี";
$level[]="หัวหน้าภาควิชา";
$level[]="อาจารย์";
$level[]="เจ้าหน้าที่";


$usermajor[]="";
$usermajor[]="ภาควิชาคณิตศาสตร์";
$usermajor[]="ภาควิชาชีววิทยา";
$usermajor[]="ภาควิชาฟิสิกส์";
$usermajor[]="ภาควิชาเคมี";
$usermajor[]=" สาขาปรีคลีนิค ";
$usermajor[]="งานนโยบายและแผน ";
$usermajor[]="งานบุคคล ";
$usermajor[]=" งานการเงินและบัญชี";
$usermajor[]="  งานพัสดุ ";
$usermajor[]="งานวิชาการ ";
$usermajor[]="งานบัณฑิตศึกษา ";
$usermajor[]="งานวิจัย ";
$usermajor[]="งานกิจการนิสิต ";
$usermajor[]=" งานธุรการ ";
$usermajor[]="งานอาคารสถานที่ ";
$usermajor[]="งานระบบเครือข่าย ";
$usermajor[]="งานสารสนเทศ ";
$usermajor[]=" งานควบคุมภายใน";
$usermajor[]="งานประกันคุณภาพการศึกษา ";
$usermajor[]=" ศูนย์เครื่องมือกลาง ";
$usermajor[]=" หน่วยวิจัยความหลากหลายทางชีวภาพฯ";
$usermajor[]="ภาควิชาวิศวกรรมสุขาภิบาล";
$usermajor[]="คณะผู้บริหาร";

$detailto= array("",
"เพื่อทราบ","อนุมัติ","อนุเคราะห์","อนุญาต","ตามเสนอ","เห็นควรตามเสนอ","ดำเนินการตามเสนอ","เพื่อพิจารณา","เพื่อโปรดทราบ","เพื่อโปรดดำเนินการ","เพื่อโปรดทราบ และสั่งการ","เพื่อทราบ และประชาสัมพันธ์","เพื่อทราบ และพิจารณา","มอบรองคณบดีฝ่ายบริหารดำเนินการ"," มอบรองคณบดีฝ่ายวิชาการ และวิจัยดำเนินการ","มอบรองคณบดีฝ่ายพัฒนานิสิต และกิจการพิเศษดำเนินการ ","แจ้งทุกภาควิชา","แจ้งภาควิชาเคมี","แจ้งภาควิชาชีววิทยา","แจ้งภาควิชาฟิสิกส์","แจ้งภาควิชาคณิตศาสตร์","มอบเลขานุการคณบดี ดำเนินการ");

$detailto2= array("","","ทราบ",
"เพื่อโปรดทราบ","เพื่อโปรดพิจารณาและสั่งการ","เพื่อทราบและถือปฏิบัติ","เพื่อพิจารณา","เพื่อพิจารณาเสนอ","เพื่ออนุมัติ","เพื่ออนุญาต","เพื่อดำเนินการต่อ");
  
$ifd_from= array(
"","คณะวิทยาศาสตร์",
"คณะมนุษยศาสตร์และสังคมศาสตร์ ",
"คณะศึกษาศาสตร์ ",
"คณะเทคโนโลยี",
"คณะพยาบาลศาสตร์ ",
"คณะการบัญชีและการจัดการ  ",
"คณะเภสัชศาสตร์  ",
"คณะวิศวกรรมศาสตร์  ",
"คณะสถาปัตยกรรมศาสตร์-ผังเมือง-นฤมิตศิลป์ ",
"คณะศิลปกรรมศาสตร์   ",
"คณะวิทยาการสารสนเทศ ",
"คณะสาธารณสุขศาสตร์ ",
"คณะแพทยศาสตร์ ",
"คณะการท่องเที่ยวและการโรงแรม ",
"วิทยาลัยการเมืองการปกครอง  ",
"บัณฑิตวิทยาลัย ",
"คณะสิ่งแวดล้อมและทรัพยากรศาสตร์ ",
"โครงการจัดตั้งคณะสัตวแพทยศาสตร์และสัตวศาสตร์",
"สำนักงานอธิการบดี ",
"กองกลาง ",
"กองแผนงาน  ",
"กองการเจ้าหน้าที่ ",
"กองกิจการนิสิต  ",
"กองทุนกู้ยืมเพื่อการศึกษา ",
"กองคลังและพัสดุ  ",
"กองบริการการศึกษา  ",
"กองทะเบียนและประมวลผล ",
"กองส่งเสริมและพัฒนางานวิจัย ",
"กองอาคารสถานที่ ",
"สำนักงานป้องกันและปราบปรามการทุจริตต่อหน้าที่",
"พิพิธภัณฑ์  ",
"สภาคณาจารย์ ",
"หน่วยตรวจสอบภายใน",
"ศูนย์ฝึกอบรมศาสตร์และศิลป์การเรียนรู้ทางการศึกษา ",
"อาคารชุดที่พักอาศัยบุคลากร",
"อาคารชุดที่พักอาศัยบุคลากร",
"สำนักคอมพิวเตอร์ ",
"สำนักวิทยบริการ",
"สำนักบริการวิชาการ",
"สถาบันวิจัยศิลปะและวัฒนธรรมอีสาน",
"สถาบันวิจัยวลัยรุกขเวช",
"โรงเรียนประถมสาธิตมหาวิทยาลัยมหาสารคาม ",
"โรงเรียนสาธิตมหาวิทยาลัยมหาสารคาม "
);
$speed[]="";
$speed[]="ปกติ";
$speed[]="ด่วน";
$speed[]="ด่วนมาก";
$speed[]="ด่วนมากที่สุด";
      
$pro[]="";
$pro[]="นำส่ง";
$pro[]="โทรสาร";
$pro[]="ลงทะเบียน";
$pro[]="EMS";
$pro[]="E-mail";
			
$attached[]="";						
$attached[]="แผ่นดิสก์";
$attached[]="หนังสือ";
$attached[]="แบบสอบถาม";
$attached[]="โปสเตอร์";
$attached[]="แบบตอบรับ";

$ofd_from= array(
"ภาควิชาคณิตศาสตร์ ",
"ภาควิชาชีววิทยา",
"ภาควิชาฟิสิกส์",
"ภาควิชาเคมี ",
" สาขาปรีคลีนิค ",
"งานนโยบายและแผน ",
"งานบุคคล ",
" งานการเงินและบัญชี",
"  งานพัสดุ ",
"งานวิชาการ ",
"งานบัณฑิตศึกษา ",
"งานวิจัย ",
"งานกิจการนิสิต ",
" งานธุรการ ",
"งานอาคารสถานที่ ",
"งานระบบเครือข่าย ",
"งานสารสนเทศ ",
" งานควบคุมภายใน",
"งานประกันคุณภาพการศึกษา ",
" ศูนย์เครื่องมือกลาง ",
" หน่วยวิจัยความหลากหลายทางชีวภาพฯ"
);
$to_form= array(
"ภาควิชาคณิตศาสตร์ ",
"ภาควิชาชีววิทยา",
"ภาควิชาฟิสิกส์",
"ภาควิชาเคมี ",
" สาขาปรีคลีนิค ",
"งานนโยบายและแผน ",
"งานบุคคล ",
" งานการเงินและบัญชี",
"  งานพัสดุ ",
"งานวิชาการ ",
"งานบัณฑิตศึกษา ",
"งานวิจัย ",
"งานกิจการนิสิต ",
" งานธุรการ ",
"งานอาคารสถานที่ ",
"งานระบบเครือข่าย ",
"งานสารสนเทศ ",
" งานควบคุมภายใน",
"งานประกันคุณภาพการศึกษา ",
" ศูนย์เครื่องมือกลาง ",
" หน่วยวิจัยความหลากหลายทางชีวภาพฯ"
);
																		
$ofd_to[]="สำนักงานคณะกรรมการการศึกษาอุดมศึกษา ";	
$ofd_to[]="กระทรวงวิทยาศาสตร์และเทคโนโลยี";
			
					  
$gofd_from[]="ภาควิชาคณิตศาสตร์";
$gofd_from[]="ภาควิชาเคมี";
$gofd_from[]="ภาควิชาชีววิทยา";
$gofd_from[]="ภาควิชาฟิสิกส์";

					  
$gofd_to[]="คณะมนุษยศาสตร์และสังคมศาสตร์ ";		
$gofd_to[]="คณะศึกษาศาสตร์";
$gofd_to[]="คณะเทคโนโลยี ";
$gofd_to[]="คณะพยาบาลศาสตร์ ";
$gofd_to[]="คณะการบัญชีและการจัดการ";
$gofd_to[]="คณะเภสัชศาสตร์";
$gofd_to[]="คณะวิศวกรรมศาสตร์";
$gofd_to[]="คณะสถาปัตยกรรมศาสตร์-ผังเมือง-นฤมิตศิลป์";
$gofd_to[]="คณะศิลปกรรมศาสตร์";
		  
					  
$orfd_from[]="สำนักงานคณะกรรมการอุดมศึกษา";	
$orfd_from[]="กระทรวงวิทยาศาสตร์และเทคโนโลยี";
$orfd_from[]="คณะศึกษาศาสตร์";
$orfd_from[]="คณะเทคโนโลยี";
$orfd_from[]="คณะพยาบาลศาสตร์";
$orfd_from[]="คณะบัญชีและการจัดการ";
$orfd_from[]="คณะเภสัชศาสตร์";				  
	
	
$idd_from[]="สำนักงานคณะกรรมการอุดมศึกษา";
$idd_from[]="กระทรวงวิทยาศาสตร์และเทคโนโลยี";
$idd_from[]="คณะศึกษาศาสตร์";
$idd_from[]="คณะเทคโนโลยี";
$idd_from[]="คณะพยาบาลศาสตร์";
$idd_from[]="คณะบัญชีและการจัดการ";
$idd_from[]="คณะเภสัชศาสตร์";     

$godp_from[]="ภาควิชาคณิตศาสตร์";
$godp_from[]="ภาควิชาเคมี";
$godp_from[]="ภาควิชาชีววิทยา";
$godp_from[]="ภาควิชาฟิสิกส์";

					  
$godp_to[]="คณะมนุษยศาสตร์และสังคมศาสตร์ ";		
$godp_to[]="คณะศึกษาศาสตร์";
$godp_to[]="คณะเทคโนโลยี ";
$godp_to[]="คณะพยาบาลศาสตร์ ";
$godp_to[]="คณะการบัญชีและการจัดการ";
$godp_to[]="คณะเภสัชศาสตร์";
$godp_to[]="คณะวิศวกรรมศาสตร์";
$godp_to[]="คณะสถาปัตยกรรมศาสตร์-ผังเมือง-นฤมิตศิลป์";
$godp_to[]="คณะศิลปกรรมศาสตร์";		

$select_date = array(1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31);

$index_doc= array("",
"001: ภาควิชาคณิตศาสตร์ ",
"002: ภาควิชาเคมี ",
"003: ภาควิชาชีววิทยา  ",
"004: ภาควิชาฟิสิกส์ ",
"005: งานคลังและพัสดุ  ",
"006: คณะวิทยาศาสตร์  ",
"007: ประกาศ มมส.  ",
"008: กองกลางงานประชุม  ",
"009: งานศิลปวัฒนธรรม  ",
"010: สำนักต่างๆ ภายใน มมส.  ",
"011: กองการเจ้าหน้าที่  ",
"012: คำสั่งคณะวิทย์ ",
"013: คำสั่ง มมส. ",
"014: บัณฑิตวิทยาลัย ",
"015: กองบริการการศึกษา ",
"016: งานสภาคณาจารย์ ",
"017: โครงการต่างๆภายใน มมส. ",
"018: กองอาคารสถานที่ ",
"019: ศูนย์ต่างๆ ของ มมส. ",
"020: คณะต่างๆใน มมส.",
"021: ฝ่ายนโยบายและวิจัย ",
"022: กองส่งเสริมและพัฒนางานวิจัย ",
"023: กองกิจการนิสิต ",
"024: กองทะเบียนและประมวลผล ",
"025: กองแผนงาน ",
"026: งานอาคารชุด  ",
"027: ร.ร.สาธิต  ",
"028: ฝ่ายพัฒนาบุคลากร ",
"029: หน่วยตรวจสอบภายใน มมส. ",
"030: ฝ่ายบริหาร + งานวิเทศสัมพันธ์ ",
"031: สหกรณ์ออมทรัพย์",
"032: หน่วยงานภายนอก  ",
"033: สำนักงานคณะกรรมการการศึกษาอุดมศึกษา  ",
"034:  กระทรวงวิทยาศาสตร์และเทคโนโลยี"
);

$select_m = array(
"มกราคม",
"กุมภาพันธ์ ",
"มีนาคม",
"เมษายน",
"พฤษภาคม",
"มิถุนายน",
"กรกฏาคม",
"สิงหาคม",
"กันยายน",
"ตุลาคม",
"พฤศจิกายน",
"ธันวาคม");
		  																	

$select_ma = array(
						"งานธุรการ",
                        "ภาควิชาคณิตศาสตร์",
                        "ภาควิชาเคมี",
                        "ภาควิชาชีววิทยา",
                        "ภาควิชาฟิสิกส์",
                        "สาขาปรีคลีนิค",
                        "งานนโยบายละแผน",
                      "งานบุคคล",
                        "งานการเงินและบัญชี",
                        "งานพัสดุ",
                        "งานวิชาการ",
                        "งานบัณฑิตศึกษา",
                        "งานวิจัย",
                        "งานกิจการนิสิต",
                        "งานอาคารสถานที่",
                        "งานระบบเครือข่าย",
                        "งานสารสนเทศ",
                        "งานควบคุมภายใน",
                        "งานประกันคุณภาพการศึกษา",
                        "ศูนย์เครื่องมือกลาง",
                        "หน่วยวิจัยความหลากหลายทางชีวภาพฯ"
						);
						
			$type_doc[]="ทุกประเภทหนังสือ";
			$type_doc[]="หนังสือรับเข้าคณะวิทยาศาสตร์";			
			$type_doc[]="หนังสือออกภายนอกมหาวิทยาลัยมหาสารคาม";	
			$type_doc[]="หนังสือออกภายในคณะวิทยาศาสตร์";	
			$type_doc[]="หนังสือคำสั่งภายในคณะวิทยาศาสตร์";	
			$type_doc[]="หนังสือรับเข้าหน่วยงาน";	
			$type_doc[]="หนังสือออกภายในหน่วยงาน";	
			$type_doc[]="นัดประชุม";	
			
		$select_priv = array(
"กระบี่",
"กรุงเทพฯ ",
"กาญจนบุรี",
"กาฬสินธุ์",
"กำแพงเพชร",
"ขอนแก่น",
"จันทบุรี",
"ฉะเชิงเทรา",
"ชลบุรี",
"ชัยนาท",
"ชัยภูมิ",
"ชุมพร",
"เชียงราย",
"เชียงใหม่",
"ตรัง",
"ตราด",
"ตาก",
"นครนายก",
"นครปฐม",
"นครพนม",
"นครราชสีมา",
"นครศรีธรรมราช",
"นครสวรรค์",
"นนทบุรี",
"นราธิวาส",
"น่าน",
"บุรีรัมย์",
"ปทุมธานี",
"ประจวบคีรีขันธ์",
"ปราจีนบุรี",
"ปัตตานี",
"พะเยา",
"พังงา",
"พัทลุง",
"พิจิตร",
"พิษณุโลก",
"เพชรบุรี",
"เพชรบูรณ์",
"แพร่",
"ภูเก็ต",
"มหาสารคาม",
"มุกดาหาร",
"แม่ฮ่องสอน",
"ยโสธร",
"ยะลา",
"ร้อยเอ็ด",
"ระนอง",
"ระยอง",
"ราชบุรี",
"ลพบุรี",
"ลำปาง",
"ลำพูน",
"เลย",
"ศรีสะเกษ",
"สกลนคร",
"สงขลา",
"สตูล",
"สมุทรปราการ",
"สมุทรสงคราม",
"สมุทรสาคร",
"สระแก้ว",
"สระบุรี",
"สิงห์บุรี",
"สุโขทัย",
"สุพรรณบุรี",
"สุราษฎร์ธานี",
"สุรินทร์",
"หนองคาย",
"หนองบัวลำภู",
"อยุธยา",
"อ่างทอง",
"อำนาจเจริญ",
"อุดรธานี",
"อุตรดิตถ์",
"อุทัยธาน",
"อุบลราชธานี"
);				
?>