-- phpMyAdmin SQL Dump
-- version 2.10.2
-- http://www.phpmyadmin.net
-- 
-- โฮสต์: localhost
-- เวลาในการสร้าง: 25 ส.ค. 2014  น.
-- รุ่นของเซิร์ฟเวอร์: 5.0.45
-- รุ่นของ PHP: 4.4.7

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- ฐานข้อมูล: `evaldb`
-- 

-- --------------------------------------------------------

-- 
-- โครงสร้างตาราง `staffinfo`
-- 

CREATE TABLE `staffinfo` (
  `staffid` varchar(10) NOT NULL,
  `staffname` varchar(100) NOT NULL,
  `staffposition` varchar(100) NOT NULL,
  `acadposition` tinyint(4) NOT NULL,
  `staffmajor` varchar(100) NOT NULL,
  `staffedu` varchar(100) NOT NULL,
  `staffcategory` varchar(100) NOT NULL,
  `commander` varchar(100) NOT NULL,
  `commanderposition` varchar(100) NOT NULL,
  `date` date NOT NULL,
  `ptime` varchar(100) NOT NULL,
  `m` tinyint(4) NOT NULL,
  `b` tinyint(4) NOT NULL,
  `p` tinyint(4) NOT NULL,
  `c` tinyint(4) NOT NULL,
  `i` tinyint(4) NOT NULL,
  `a` tinyint(4) NOT NULL,
  PRIMARY KEY  (`staffid`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- 
-- dump ตาราง `staffinfo`
-- 

INSERT INTO `staffinfo` VALUES ('482', 'เกรียงไกร นามพุทธา', 'นักวิชาการคอมพิวเตอร์', 3, 'สํานักงานเลขานุการ', 'ปริญญาตรี', 'ลูกจ้างชั่วคราว', 'ผศ. ดร. บังอรกุมพล', 'รองคณบดีฝ่ายกิจการพิเศษและวิเทศสัมพันธ์', '2014-08-25', '3 ปี', 2, 2, 2, 2, 2, 2);
INSERT INTO `staffinfo` VALUES ('581', 'จิตรลดา วิชาผง', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'รักษาราชการหัวหน้าภาควิชาเคมี', '2014-02-25', '1 ปี 4 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('166', 'พรนิภา  วิจารณ์จิต', '', 0, 'สํานักงานเลขานุการ', 'ปริญญาตรี', 'ข้าราชการ', '', '', '2013-01-31', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('466', 'นางจีระนันท์ คำภักดี', 'อาจารย์', 0, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'ข้าราชการ', 'อ.ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('334', 'ณภัสนันท์ ศรีสารคาม', 'อาจารย์', 0, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-21', '15 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('470', 'สุรเวช สุธีธร', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ศาสตราจารย์ ดร.วิเชียร มากตุ่น', 'คณบดีคณะวิทยาศาสต์', '2014-08-25', '1 เม.ย. -30 ก.ย. 57', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('143', 'ศิริลักษณ์ เจิมจิตต์พรชัย', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'ข้าราชการ', 'ดร มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-03-11', '1ตุลาคม  2555 -31 มีนาคม 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('310', 'ธีรวงศ์ เหล่าสุวรรณ', ' ', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร. นิติศักดิ์ ปาสาจะ ', 'หัวหน้าภาควิชา', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('331', 'นิภาพร ชุติมันต์', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-08-25', '1 เมษายน 2557 ถึงวันที่ 30 กันยายน2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('563', 'อารยา ตาพล', '', 0, 'ศูนย์เครื่องมือกลาง', '', '', '', '', '0000-00-00', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('359', 'เสนีย์  เครือเนตร', 'อาจารย์', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร. ประสงค์ สีหานาม', 'หััวหน้าภาควิชาเคมี', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('227', 'จีระพรรณ สุขศรีงาม', 'รองศาสตราจารย์', 3, 'ภาควิชาชีววิทยา', 'ปริญญาโท', 'ข้าราชการ', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('220', 'ต่อศักดิ์ โกมาสถิตย์', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'ข้าราชการ', 'ดร. นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-02-24', '1 ต.ค..2556- 31 มี.ค. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('285', 'สุรัตน์  เวชรัตนเชษฐ์', '', 0, 'สํานักงานเลขานุการ', 'ปริญญาตรี', 'ข้าราชการ', '', '', '2013-03-04', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('153', 'นงนิตย์ มรกต', 'รองศาสตราจารย์', 3, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '36 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('360', 'พรทิพย์ อติชาติ', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-03-07', '17 ตุลาคม 2537 - ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('570', 'คณิศรา ชาวนา', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-02-21', '1 ปี 2 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('133', 'ปิยภัทร บุษบาบดินทร์', 'อาจารย์  ระดับ 6', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'ข้าราชการ', 'อ.ดร.มนตรี  ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-21', 'รายงานตัวกลับเข้าทำงาน 14 พฤษภาคม 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('263', 'ผศ.ดร.อภิเดช แสงดี', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-17', '10', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('193', 'รศ.ดร.วรรณา กาญจนมยูร', 'รองศาสตราจารย์', 3, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('148', 'มะลิวัลย์ ถุนาพรรณ์', '', 0, 'ภาควิชาคณิตศาสตร์', 'ปริญญาตรี', 'ข้าราชการ', '', '', '2013-02-22', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('279', 'ธีระศักดิ์   ธงยันต์', '', 0, 'สํานักงานเลขานุการ', 'ปริญญาตรี', 'พนักงานในสถาบันอุดมศึกษา', '', '', '2013-02-20', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('553', 'กฤษกร  ปาสาใน', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'อาจารย์', '2014-08-25', 'เริ่มทดลองงาน 18 พฤษภาคม 2554  เริ่มเซ็นสัญญาทำงาน 1 ตุลาคม 2555', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('330', 'นงลักษณ์  วิริยะพงษ์', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายมนตรี   ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์.', '2014-02-21', '1 ตุลาคม พ.ศ. 2556 ถึง 31 มีนาคม พ.ศ.2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('218', 'อ.ดร.ฤทธิไกร ไชยงาม', 'อาจารย์', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-02-25', '8 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('137', 'นงนุช แสงสุระ', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ปิยภัทร บุษบาบดินทร์', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-08-25', '8', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('306', 'จันทร์ฉาย กรรภิรมย์', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'ข้าราชการ', 'ดร. นิติศักดิ์  ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-02-25', '30 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('467', 'วิลาวัณย์  พร้อมพรม', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-03-06', '1 ตุลาคม 2556- 31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('455', 'ขนิษฐา สมตระกูล', 'อาจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-18', '4 ปี 2 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('352', 'วีระวุฒิ อรุณวรรธนะ', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'ข้าราชการ', '', '', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('209', 'วัลยา สุทธิขำ', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-03-15', '8 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('538', 'อุฤทธิ์ เจริญอินทร์', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '26 พ.ค. 2557  ถึง 30 ก.ย. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('536', 'วิชญ รัชตเวชกุล', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร. ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '1 เมษายน 2557 - 30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('513', 'ประธาน ศรีวิไล', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '1 เมษายน 2557 --31 ตุลาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('560', 'ศุภชัย ฤทธิ์เจริญวัตถุ', 'อาจารย์', 0, 'คณะผู้บริหาร', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร. นิติศักดิ์  ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-02-20', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('225', 'พิษณุ พูลเจริญศิลป์', 'อาจารย์', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'ข้าราชการ', '', '', '2014-08-25', '15 พ.ย. 2545 ถึง ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('552', 'อัณศยา  ท่อนโพธิ์', 'อาจารย์', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '1 เมษายน 2557- 30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('371', 'ขวัญเรือน  บุตรสาทร  พาป้อง', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '5 ปี 9 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('232', 'นพคุณ ภักดีณรงค์', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-08-25', '16 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('531', 'สุภกร หาญสูงเนิน', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร. นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '1 มิถุนายน 2556 ถึง 30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('573', 'ปิยะธิดา พิมพ์วิชัย', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-03-05', '1 ปี 7 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('194', 'ปิยะเนตร จันทร์ถิระติกุล', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร. ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '16 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('155', 'สุนันท์ สายกระสุน', 'รองศาสตราจารย์', 3, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ. ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '19 มกราคม 2542 - ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('366', 'ดร.อาทิตย์ ฉิ่งสูงเนิน', 'อาจารย์', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.นิติศักย์ ปาสาจะ', 'อาจารย์', '2014-08-25', '6 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('492', 'ปรีชา ศรีประภาคาร', 'อาจารย์', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร.นิติศักดิ์  ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-02-24', '10', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('464', 'รุ่งลาวัลย์   บุตรโคตร', '', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'ข้าราชการ', 'นาย มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-22', '15', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('222', 'ธนัทเดช โรจนกุศล', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชา', '2014-02-20', '1 ตุลาคม 2555 - 31 มีนาคม 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('461', 'ทัศน์วรรณ แก้ววังชัย', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ. ดร. ประสงค์  สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '4', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('228', 'ชูศรี ตลับมุข', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'นายภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-22', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('506', 'อรอุมา จันทร์เสถียร', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล  โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '6 ตุลาคม 2553 ถึง ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('203', 'นางสาวประไพรัตน์ สีพลไกร', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'นายประสงค์ สีหานาม', 'รักษาการหัวหน้าภาควิชาเคมี', '2014-08-25', '1 เมษายน 2557 - 31 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('252', 'ไพโรจน์ ประมวล', 'รองศาสตราจารย์', 3, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '6 ปี 11 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('578', 'เจนจิรา เปี่ยมดี', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาค', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('332', 'บังอร กุมพล', 'ผู้ช่วยศาสตราจารย์', 2, 'คณะผู้บริหาร', 'ปริญญาเอก', 'ข้าราชการ', 'ศาสตราจารย์ วิเชียร มากตุ่น', 'คณบดีคณะวิทยาศาสตร์', '2014-08-25', '15', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('198', 'สมชาย แก้ววังชัย', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ. ดร. ประสงค์  สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-08-25', '6', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('548', 'นายธีรพร กทิศาสตร์', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '8 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('365', 'หัวหน้าภาควิชาฟิสิกส์ (อ.ดร.นิติศักดิ์ ปาสาจะ)', 'หัวหน้าภาควิชาฟิสิกส์', 1, 'คณะผู้บริหาร', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'รศ.ดร.เทียนศักดิ์ เมฆพรรณโอภาส', 'คณบดีคณะวิทยาศาสตร์', '2014-03-05', '12 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('362', 'นายวรรณชัย ชาแท่น', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-03-06', '1 ตุลาคม 2556-31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('439', 'ชวลิต  บุญปก', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'ข้าราชการ', 'ดร.มนตรี  ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-24', '1  ตุลาคม  2555 - 31  มีนาคม  2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('413', 'ประภาส  ผิวอ่อน', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชา', '2014-02-21', '5 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('444', 'โชคชัย วิริยะพงษ์', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายมนตรี   ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-08-21', '1 เมษายน พ.ศ. 2557 ถึง 30 กันยายน พ.ศ.2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('541', 'พนิดา  เล้าชาญวุฒิ', 'อาจารย์ระดับ 7', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'รองศาสตราจารย์ เทียนศักดิ์ เมฆพรรณโอภาส', 'รักษาการคณบดีคณะวิทยาศาสตร์', '2014-02-21', '14 ปี 9 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('446', 'ปวีณา เหลากูล', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายนิติศักดิ์  ปาสาจะ', 'อาจารย์', '2014-08-25', '1 เม.ย. 2557 - 30 ก.ย. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('539', 'บุษรา ยงคำชา', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', '', '', '2014-02-21', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('373', 'ปิยะพร แสนสุข', 'อาจารย์', 2, 'คณะผู้บริหาร', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ศ.ดร.วิเชียร มากตุ่น', 'คณบดีคณะวิทยาศาสตร์', '2014-08-25', '15 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('386', 'อุษา ทองไพโรจน์', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล  โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-03-05', '1 ตุลาคม พ.ศ. 2556 ถึง 31 มีนาคม พ.ศ. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('250', 'บังอร กองอิ้ม', 'ผู้ช่วยศาสตราจารย์ ', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-28', '11 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('136', 'นางสาวจันทร์เจริญ  รักษ์มณี', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'ข้าราชการ', 'นางสาวปิยภัทร บุษบาบดินทร์', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-08-25', '1เม.ย.57-30ก.ย.57', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('158', 'อรอนงค์ ชีระโรจน์', 'อาจารย์', 1, 'ภาควิชาเคมี ', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'ผู้ช่วยศาสตราจารย์', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('248', 'จิรภา เพชร์สม', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-07-15', '1 ตุลาคม 2556 - 30 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('257', 'วรนันต์ นาคบรรพต', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร.ภูวดล  โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '1 เมษายน 2557 - 30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('305', 'ไพรัตน์ ธรรมแสง', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'ข้าราชการ', 'นายนิติศักดิ๋  ปาสาจะ', 'หัวหน้าภาควิชา', '2014-08-25', '29 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('224', 'ปรเมษฐ์ จันทร์เพ็ง', 'อาจารย์', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'ข้าราชการ', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('487', 'ธีรชัย  คุณโทถม', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ประสงค์ สีหานาม', 'ผู้ช่วยศาสตราจารย์', '2014-08-25', '3.5 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('370', 'จุฑาพร แสงประจักษ์', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-03-05', '5 ปี 5 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('452', 'สุคนธ์ทิพย์ เศวตนลินทล', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-20', '11 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('355', 'ดร.อนุสรณ์ แสงประจักษ์', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'ข้าราชการ', 'ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '14 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('265', 'อาจินต์ ไพรีรณ', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเทียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-03-07', '11 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('551', 'วราภรณ์  สุทธิสา', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล  โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-08-25', '3 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('496', 'ปัทมาวดี   เงินจันทร์', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '1 เมษายน  - 30 กันยายน 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('388', 'ศรัณยู คำเมือง', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-02-26', '1 ตุลาคม 2556 - 31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('246', 'กมลหทัย แวงวาสิต', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-08-25', ' 1 เม.ย. 56-30 ก.ย. 56', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('236', 'ชนิดาพร ตุ้มปี่สุวรรณ', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'อ. ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-02-20', '1 เม.ย 2556-30 ก.ย 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('501', 'ปิยนุช คะเณมา', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '3 ปี 8 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('201', 'อุทัย สาขี', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร. ประสงค์ สีหานาม', 'ผู้รักษาราชการแทนหัวหน้าภาควิชาเคมี ', '2014-08-25', '10 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('135', 'กฤตยา แสนศักดิ์', 'อาจารย์', 0, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'ข้าราชการ', 'ดร.ปิยภัทร   บุษบาบดินทร์', 'อาจารย์', '2014-08-25', '30 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('550', 'ร.ต.ท.หญิง ดร. อุไรวรรณ  กมลภพ', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร. ประสงค์ สีหานาม', 'ผู้รักษาราชการแทนหัวหน้าภาควิชาเคมี', '2014-02-27', '1 ตุลาคม 2556-31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('432', 'รัชนีกร วันจันทึก', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ ดร ประสงค์   สีหานาม', 'ผู้รักษาราชการแทนหัวหน้าภาควิชา', '2014-08-25', '5 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('576', 'กานต์สิริ ปักเคธาติ', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'รักษาราชการหัวหน้าภาควิชาเคมี', '2014-02-27', '1 ปี 6 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('585', 'อุทุมพร ดีศรี', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-03-07', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('200', 'มัณทนา นครเรียบ', 'อาจารย์', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผู้ช่วยศาสตราจารย์ ดร. ประสงค์ สีหานาม', 'ผู้รักษาราชการแทนหัวหน้าภาควิชาเคมี', '2014-08-25', '1 ตุลาคม 2556 - 31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('568', 'เกรียงไกร พลหงษ์', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ. ดร.ประสงค์ สีหานาม', 'ผู้รักษาราชการแทนหัวหน้าภาควิชาเคมี', '2014-02-25', '1 ปี 6 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('157', 'ยอดธง ใบมาก', 'รองศาสตราจารย์', 3, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-02-27', '9 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('260', 'สุนันทา จุลเจือ', 'พนักงานวิชาการ/อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '๕ ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('140', 'อภินันท์ อนันต์พินิจวัฒนา', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'ข้าราชการ', '', '', '2014-02-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('503', 'สุจิรา มณีรัตน์', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-02-21', '11 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('253', 'ภาสกร บุญชาลี', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2013-03-07', '1 ตุลาคม 2555-31 มีนาคม 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('247', 'ดร. คมศร เลาห์ประเสริฐ', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('144', 'อัมพร อนันต์พินิจวัฒนา', 'รองศาสตราจารย์', 3, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'ข้าราชการ', '', '', '2014-02-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('304', 'รักฤดี  สารธิมา', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชา', '2014-02-26', '1 ตุลาคม 2556 - 31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('145', 'มิตรี กระพี้แดง', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'ข้าราชการ', 'ดร.', 'หัวหน้าภาควิชาคณิตศาสตร์/ -', '2014-08-25', '16', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('567', 'นางสาวมนชยา  เจียงประดิษฐ์', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร. มนตรี  ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-21', '1 ตุลาคม 2556 -31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('443', 'กิตติศักดิ์ แสงสุระ', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-24', '12', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('435', 'อ.ดร.อนุวัฒน์ วันทอง', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '4 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('533', 'ดร.ดรุณี บุญชารี', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-25', '1 ตุลาคม 2556 ถึง  31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('454', 'อ.ยุทธนา อุไรชื่น', '', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'นายนิติศักดิ์ บาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('159', 'สุภลักษณ์ อรรถรังสรรค์', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'รักษาราชการแทนหัวหน้าภาควิชาเคมี', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('465', 'นางสาว วัสกา ศิริอังคาวุธ', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'หัวหน้าภาควิชาเคมี', '2014-02-21', '4 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('191', 'ณัฏฐาเนตร นันทบุตร', 'อาจารย์', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', '', '2014-02-27', '7 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('554', 'สุธิรา มณีฉาย', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล  โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-03-05', '1 ตุลาคม พ.ศ. 2556 ถึง 31 มีนาคม พ.ศ. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('346', 'นิคม นครเรียบ', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '1 มิถุนายน 2543 ถึง ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('149', 'เขมนันท์  ขามทอง', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'นายมนตรี  ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-21', 'ระหว่างวันที่  1  เดือน พฤษภาคม พ.ศ. 2556   ถึงวันที่ 30 เดือน กันยายน พ.ศ. 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('473', 'วัชรา กาญจนรัช', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '  15 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('205', 'อ.ดร. สุจินต์ อังกุราวิรุทธ์', 'อาจารย์ ระดับ 7', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร. ประสงค์ สีหานาม', 'รักษาการหัวหน้าภาควิชาเคมี คณะวิทยาศาสตร์', '2014-08-25', 'วงรอบ (1 ตุลาคม 2556 - 31 มีนาคม 2557)', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('168', 'เสาวนีย์ รัตนะวัน ', '', 0, 'สํานักงานเลขานุการ', 'ปริญญาตรี', '', '', '', '2013-03-04', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('142', 'อรุณ  แก้วมั่น', '', 0, 'ภาควิชาคณิตศาสตร์', '', '', '', '', '0000-00-00', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('433', 'ขวัญฤทัย  วงศาพรม', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายนิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('459', 'นิชชา  จำเริญศักดิ์ศรี', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเทียร', 'หัวหน้าภาควิชา', '2014-08-25', '4ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('261', 'สุมาลี ชูกำแพง', 'พนักงานวิชาการ', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายภูวดล โกมณเทียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '15 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('423', 'ประสงค์    สีหานาม', 'ผู้ช่วยศาตราจารย์', 2, 'คณะผู้บริหาร', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'รศ. เทียนศักดิ์ เมฆพรรณโอภาส', 'คณบดี', '2014-03-02', '1 ตุลาคม 2555 ถึง 31 มีนาคม 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('294', 'ต่อศักดิ์ โกมาสถิตย์', 'อาจารย์', 2, 'ภาควิชาฟิสิกส์ คณะวิทยาศาสตร์', 'ปริญญาโท', 'ข้าราชการ', '', '', '2013-08-09', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('569', 'สุจิตตา สุระภี', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี  ทองมูล', 'หัวหน้าภาควิชา', '2014-03-11', '13 ปี กับ 4 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('421', 'หทัยทิพย์ อุดชาชน', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '5 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('238', 'ดร. ปิยมาศ นานอก โสภาลดาวัลย์', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'อาจารย์ ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-24', '15 ปี ', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('219', 'อรวรรณ ฤทธิเดช', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'ข้าราชการ', 'นายนิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '16 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('401', 'วันวิสาข์ ศิริวัฒนเมธานนท์', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '13 ปี ', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('258', 'สาน วิไล', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '1 เมษายน 2556- 30 กันยายน 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('447', 'ชาติไทย แก้วทอง', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร. ประสงค์ สีหานาม', '', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('512', 'ศักดิ์บวร ตุ้มปี่สุวรรณ', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-20', '3 ปี 1 ภาคการศึกษา', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('500', 'อ.ดร.อิสระ ธานี', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมลเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('363', 'บังอร แถวโนนงิ้ว', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'หัวหน้าภาควิชาชีววิทยา', 'อาจารย์', '2014-02-21', '15 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('577', 'บุษกร คงเอียด', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-21', '1 เมษายน 2556 ถึง 30 กันยายน 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('348', 'พัฒนพล มีนา', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชา', '2014-08-21', '1 เม.ย  2556-31 ก.ย. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('540', 'พรชัย อุทรักษ์', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร ', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '1ปี 6 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('242', 'วันชัย สังฆ์สุข', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาโท', 'ข้าราชการ', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('437', 'วุฒิศาสตร์ โชคเกื้อ', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.นิติศักดิ์  ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', ' 1 ตุลาคม 2555 ถึง 31 มีนาคม 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('240', 'หัวหน้าภาควิชาชีววิทยา (อ.ดร.ภูวดล โกมณเฑียร)', 'อาจารย์', 1, 'คณะผู้บริหาร', 'ปริญญาเอก', 'ข้าราชการ', 'รศ.ดร.เทียนศักดิ์ เมฆพรรณโอภาส', 'คณบดี', '2014-02-28', '2540-ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('526', 'ดาริน  อ่อนขาว', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ ดร. นิติศักดิ์  ปาสาจะ', 'หัวหน้าภาควิชา', '2014-08-25', '2 ปี 3 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('341', 'ประยุกต์  ศรีวิไล', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'ข้าราชการ', 'รศ. เทียนศักดิ์ เมฆพรรณโอภาส ', 'รักษาการคณบดีคณะวิทยาศาสตร์', '2014-02-21', '14 ปี 2 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('333', 'อ.ดร.มนตรี ทองมูล', 'อาจารย์', 1, 'คณะวิยาศาสตร์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ศ.ดร.วิเชียร  มากตุ่น', 'คณบดีคณะวิทยาศาสตร์', '2014-08-20', '1 เมษายน 2557  ถึง 30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('474', 'อรอุมา แก้วกล้า', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ. ดร. ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-08-25', '13', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('223', 'ธนา ยีรัมย์', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', ' นิติศักดิ์ ปาสาจะ', 'อาจารย์ ดร.', '2014-08-25', '7 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('345', 'ธีรพจน์  พุทธิกีฏกวีวงศ์', 'รองศาสตราจารย์. ระดับ 9', 3, 'ภาควิชาฟิสิกส์', 'ปริญญาโท', 'ข้าราชการ', '', '', '2013-09-03', '31 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('254', 'มงคล อุดชาชน', 'ผู้ช่วยศาสตราจารย์', 2, 'คณะผู้บริหาร', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อ.ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชา', '2014-08-25', '6 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('387', 'สิริภัค สุระพร', 'ผู้ช่วยศาสตราจารย์', 2, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเพียร', 'หัวหน้าภาควิชาชีววิทยา คณะวิทยาศาสตร์', '2014-03-06', '13 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('235', 'จักรกฤษณ์ ภารการ', 'อาจารย์', 1, 'ภาควิชาชีววิทยา', 'ปริญญาตรี', 'ข้าราชการ', 'ดร.ภูวดล  โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-05', '27 ม.ค. 2541 ถึงปัจจุบัน รวม 16 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('255', 'รุ่งฤดี ทิวทอง', 'อาจารย์', 0, 'ภาควิชาชีววิทยา', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ภูวดล โกมณเฑียร', 'หัวหน้าภาควิชาชีววิทยา', '2014-02-21', '9 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('210', 'เนื้อทิพย์ ดำรงค์ไชย', 'อาจารย์ ระดับ 7', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ. ดร. ประสงค์ สีหานาม', 'หัวหน้าภาควิชา', '2014-08-25', 'ปี 2538 ถึง ปัจจุบัน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('156', 'บรรจบ วันโน', 'อาจารย์', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร.ประสงค์ สีหานาม', 'ผู้รักษาการราชการแทนหัวหน้าภาควิชาเคมี', '2014-02-26', '7 ปี', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('398', 'มังกร ศรีสะอาด', 'อาจารย์', 0, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร. ประสงค์ สีหานาม ', '', '2014-02-28', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('601', 'นายวิญญา ดุงแก้ว', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร. ประสงค์ สีหานาม', 'รักษาการหัวหน้าภาควิชาเคมี', '2014-02-27', '19 พ.ย. 2556 - 31 มี.ค. 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('594', 'วรุจน์ นาคเสน', 'พนักงานวิชาการ', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาค', '2014-02-21', '13 สิงหาคม 2556 - 3', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('204', 'น้อย เนียมสา', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'ข้าราชการ', 'ผศ.ดร. ประสงค์ สีหานาม', '', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('589', 'จตุพร  แสนบริสุทธิ์', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี   ทองมูล', 'อาจารย์', '2014-03-05', '1 พ.ค. 2556 -30 มี.ค 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('599', 'พรรณวดี จุรีมาศ', '-', 2, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นายนิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '1 เมษายน 2557-30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('221', 'เจษฏา จุรีมาศ', '-', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'นาย นิติศักดิ์ ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-08-25', '12 เมษายน 2557 - 30 กันยายน 2557', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('354', 'สิริยาภรณ์ แสงอรุณ', '', 0, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', '', '', '2014-08-25', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('357', 'นวลอนงค์  นาคคง', 'นักวิทยาศาสตร์ ระดับ 0', 0, 'หน่วยบริการวิชาการด้านเครื่องวิทยาศาสตร์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', '', '', '2014-02-21', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('322', 'วัฒนา   วงษ์ทรัพย์', '', 0, 'สํานักงานเลขานุการ', 'ปริญญาตรี', 'ข้าราชการ', '', '', '2014-08-20', '', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('590', 'สุชาติ โอษคลัง', 'อาจารย์', 1, 'ภาควิชาฟิสิกส์', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'อาจารย์ นิติศักดิ์  ปาสาจะ', 'หัวหน้าภาควิชาฟิสิกส์', '2014-02-21', '3 พ.ค. 2556 - 2 ส.ค. 2556', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('582', 'คงวิทย์ ประสิทธิ์นอก', 'อาจารย์', 1, 'ภาควิชาเคมี', 'ปริญญาเอก', 'พนักงานในสถาบันอุดมศึกษา', 'ผศ.ดร.ประสงค์ สีหานาม', 'รักษาราชการหัวหน้าภาควิชาเคมี', '2014-02-26', '1 ปี 4 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('611', 'ดร. วิภาวี ตั้งใจ', '', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาตรี', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.ปิยภัทร บุษบาบดินทร์', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-08-25', '2 เดือน', 0, 0, 0, 0, 0, 0);
INSERT INTO `staffinfo` VALUES ('595', 'ฉลองชัย กล้าณรงค์', 'อาจารย์', 1, 'ภาควิชาคณิตศาสตร์', 'ปริญญาโท', 'พนักงานในสถาบันอุดมศึกษา', 'ดร.มนตรี ทองมูล', 'หัวหน้าภาควิชาคณิตศาสตร์', '2014-02-21', '8 สิงหาคม 2556 - 31 มีนาคม 2557', 0, 0, 0, 0, 0, 0);
