<?php

session_start();
if( $_SESSION[session_log]<>session_id())
{
header("Location: ../index.php");
exit();
}

include"../tools/connect-eval.php";

	    $Mquery = "SELECT * FROM  `staffinfo`  where staffinfo.staffid=".$_SESSION[session_user_id];
		$Mresult = mysql_query($Mquery);
		$Mrow = mysql_fetch_array($Mresult);
		if(!( $Mrow ['m']||$Mrow ['p']||$Mrow ['b']||$Mrow ['c']||$Mrow ['a']) )
		{  
				header("Location: ../index.php");
				exit();		
		}

		$query = "SELECT * FROM `weight`,`wselect` where  weight.id=wselect.wtid and wselect.userid=$id";
		$result = mysql_query($query);
     	if($row = mysql_fetch_assoc($result));if($row['status'])$percent=50; else $percent=70;
		
$id=$_GET['id'];

$query = "SELECT * FROM `staffinfo`  where   staffid = '$id' ";
$result = mysql_query($query);
$r = mysql_fetch_assoc($result);


require('fpdf.php');
 
$pdf=new FPDF( 'L' , 'mm' , 'A4' );
$pdf->AddPage();

$x1=15;
$y1=5;
$x2=285;
$y2=185;
$h=6;

$pdf->SetTextColor(0,0,0); 

$pdf->AddFont('THSarabun','','THSarabun.php');//¸ÃÃÁ´Ò
$pdf->AddFont('THSarabun','b','THSarabun Bold.php');//Ë¹Ò
$pdf->SetFont('THSarabun','',13);


$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.1);

$pdf->SetFont('THSarabun','b',15);

$pdf->SetXY(15,4+$h*0);
$pdf->Write(10,'                            ¢éÍµ¡Å§áÅÐáºº¡ÒÃ»ÃÐàÁÔ¹¾ÄµÔ¡ÃÃÁ¡ÒÃ»¯ÔºÑµÔÃÒª¡ÒÃ¢Í§¢éÒÃÒª¡ÒÃáÅÐ¾¹Ñ¡§Ò¹  ÊÑ§¡Ñ´ÁËÒÇÔ·ÂÒÅÑÂÁËÒÊÒÃ¤ÒÁ (Í§¤ì»ÃÐ¡Íº·Õè 2)                áºº ».02');
$pdf->SetXY(15,4+$h*1);
$pdf->Write(10,'                                                                       ÃÍº¡ÒÃ»ÃÐàÁÔ¹   Ç§ÃÍº·Õè 1 ÃÐËÇèÒ§ÇÑ¹·Õè 1 ÁÕ¹Ò¤Á - 31 ÊÔ§ËÒ¤Á 2567   ');
$pdf->SetXY(145,4+$h*2);
//$pdf->Write(10,'                 ª×èÍ¼ÙéÃÑº¡ÒÃ»ÃÐàÁÔ¹ ...'. $r['staffname'].'....µÓáË¹è§/ÃÐ´Ñº ....'. $r['staffposition'].'... ÊÑ§¡Ñ´ ¤³ÐÇÔÈÇ¡ÃÃÁÈÒÊµÃì ÁËÒÇÔ·ÂÒÅÑÂÁËÒÊÒÃ¤ÒÁ ');
$pdf->Cell(10,10,'ª×èÍ¼ÙéÃÑº¡ÒÃ»ÃÐàÁÔ¹ ...'. $r['staffname'].'....µÓáË¹è§/ÃÐ´Ñº ....'. $r['staffposition'].'... ÊÑ§¡Ñ´ ¤³ÐÇÔÈÇ¡ÃÃÁÈÒÊµÃì ÁËÒÇÔ·ÂÒÅÑÂÁËÒÊÒÃ¤ÒÁ ',0,1,'C');
$pdf->SetXY(145,4+$h*3);
//$pdf->Write(10,'                 ª×èÍ¼ÙéºÑ§¤ÑººÑ­ªÒ/¼Ùé»ÃÐàÁÔ¹ ......'. $r['commander'].'.......  µÓáË¹è§/ÃÐ´Ñº .......'. $r['commanderposition'].'....... ');
$pdf->Cell(10,10,'ª×èÍ¼ÙéºÑ§¤ÑººÑ­ªÒ/¼Ùé»ÃÐàÁÔ¹ ......'. $r['commander'].'.......  µÓáË¹è§/ÃÐ´Ñº .......'. $r['commanderposition'].'.......',0,1,'C');

$pdf->SetFont('THSarabun','',13);
$pdf->SetXY(15,4+$h*5);
$pdf->Write(10,'            ¡. ÊÁÃÃ¶¹ÐËÅÑ¡                 (1) ÃÐ´Ñº       (2) ÃÐ´Ñº                      ¢. ÊÁÃÃ¶¹Ðà©¾ÒÐµÒÁ           (3) ÃÐ´Ñº        (4) ÃÐ´Ñº');
$pdf->SetXY(15,4+$h*6);
$pdf->Write(10,'         (ÊÓËÃÑº¢éÒÃÒª¡ÒÃáÅÐ             ÊÁÃÃ¶¹Ð      ÊÁÃÃ¶¹Ð                         ÅÑ¡É³Ð§Ò¹·Õè»¯ÔºÑµÔ           ÊÁÃÃ¶¹Ð         ÊÁÃÃ¶¹Ð');
$pdf->SetXY(15,4+$h*7);
$pdf->Write(10,'            ¾¹Ñ¡§Ò¹ ·Ø¡¤¹)                ·Õè¤Ò´ËÇÑ§       ·ÕèáÊ´§ÍÍ¡               (ÊÓËÃÑº¢éÒÃÒª¡ÒÃáÅÐ¾¹Ñ¡§Ò¹       ·Õè¤Ò´ËÇÑ§       ·ÕèáÊ´§ÍÍ¡');
$pdf->SetXY(15,4+$h*8);
$pdf->Write(10,'                                                                                                à©¾ÒÐµÒÁµÓáË¹è§·ÕèÃÑº¼Ô´ªÍº');
$pdf->SetXY(15,4+$h*9);
$pdf->Write(10,'                                                                                                       µÒÁ·Õè ¡.º.Á. ¡ÓË¹´)');
$pdf->SetXY($x1+5,4+$h*10);
$pdf->Write(10,'¡. 1 ¡ÒÃÁØè§¼ÅÊÑÁÄ·¸Ôì');
$pdf->SetXY($x1+5,4+$h*11);
$pdf->Write(10,'¡. 2 ¡ÒÃºÃÔ¡ÒÃ·Õè´Õ');
$pdf->SetXY($x1+5,4+$h*12);
$pdf->Write(10,'¡. 3 ¡ÒÃÊÑè§ÊÁ¤ÇÒÁàªÕèÂÇªÒ­');
$pdf->SetXY($x1+5,4+$h*13);
$pdf->Write(10,'         ã¹§Ò¹ÍÒªÕ¾');
$pdf->SetXY($x1+5,4+$h*14);
$pdf->Write(10,'¡. 4 ¡ÒÃÂÖ´ÁÑè¹ã¹¤ÇÒÁ¶Ù¡µéÍ§');
$pdf->SetXY($x1+5,4+$h*15);
$pdf->Write(10,'      ªÍº¸ÃÃÁáÅÐ¨ÃÔÂ¸ÃÃÁ');
$pdf->SetXY($x1+5,4+$h*16);
$pdf->Write(10,'¡. 5 ¡ÒÃ·Ó§Ò¹à»ç¹·ÕÁ');


$x1=10;
$y1=25;
$x2=110;
$y2=103;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
//$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
//$pdf->Line($x1+10,$y1+10+$h*10, $x2-10, $y1+10+$h*10);
$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+10,$y1+10+$h*13, $x2-10, $y1+10+$h*13);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+50,$y1+10, $x1+50, $y2+10);
$pdf->Line($x1+70,$y1+10, $x1+70, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$x1=100;
$y1=25;
$x2=200;
$y2=103;
$h=6;

$pdf->SetXY($x1+10,4+$h*10);
$pdf->Write(10,'¢.1 ¡ÒÃ¤Ô´ÇÔà¤ÃÒÐËì');
$pdf->SetXY($x1+10,4+$h*11);
$pdf->Write(10,'¢.2 ¡ÒÃ´Óà¹Ô¹¡ÒÃàªÔ§ÃØ¡');
$pdf->SetXY($x1+10,4+$h*12);
$pdf->Write(10,'¢.3 ¤ÇÒÁ¼Ù¡¾Ñ¹·ÕèÁÕµèÍÊèÇ¹ÃÒª¡ÒÃ');
$pdf->SetXY($x1+10,4+$h*13);
$pdf->Write(10,'¢.4 ¡ÒÃÁÍ§ÀÒ¾Í§¤ìÃÇÁ');
$pdf->SetXY($x1+10,4+$h*14);
$pdf->Write(10,'¢.5 ¡ÒÃãÊèã¨áÅÐ¾Ñ²¹Ò¼ÙéÍ×è¹');
$pdf->SetXY($x1+10,4+$h*15);
$pdf->Write(10,'¢.6  ¤ÇÒÁà¢éÒã¨¼ÙéÍ×è¹');


$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
$pdf->Line($x1+10,$y1+10+$h*10, $x2-10, $y1+10+$h*10);
//$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+10,$y1+10+$h*13, $x2-10, $y1+10+$h*13);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+53,$y1+10, $x1+53, $y2+10);
$pdf->Line($x1+70,$y1+10, $x1+70, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);



$x1=190;
$y1=25;
$x2=290;
$y2=103;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
$pdf->Line($x1+10,$y1+10+$h*10, $x2-10, $y1+10+$h*10);
$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+10,$y1+10+$h*13, $x2-10, $y1+10+$h*13);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+50,$y1+10, $x1+50, $y2+10);
$pdf->Line($x1+70,$y1+10, $x1+70, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$x1=10;
$y1=110;
$x2=290;
$y2=176;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*4, $x2-10, $y1+10+$h*4);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+210,$y1+19, $x2-10, $y1+19);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+210,$y1+10, $x1+210, $y2-8);
$pdf->Line($x1+230,$y1+19, $x1+230, $y2-8);
$pdf->Line($x1+250,$y1+19, $x1+250, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$pdf->Line($x1+100,$y1+10+$h*10, $x1+170, $y1+10+$h*10);

$x1=10;
$y1=25;
$x2=200;
$y2=103;
$h=6;

$pdf->SetXY($x1+10,6+$h*19);
$pdf->Write(10,'                                                                                                                                                                                                                             (7) ¡ÒÃ»ÃÐàÁÔ¹');
$pdf->SetXY($x1+10,8+$h*20);
$pdf->Write(10,'                                                                                                                                                                                                              ¨Ó¹Ç¹           ¤Ù³´éÇÂ           ¤Ðá¹¹');
$pdf->SetXY($x1+10,8+$h*21);
$pdf->Write(10,'                                                                                                                                                                                                            ÊÁÃÃ¶¹Ð');
$pdf->SetXY($x1+10,6+$h*20);
$pdf->Write(10,'                                                                                       à¡³±ì¡ÒÃ»ÃÐàÁÔ¹');

$pdf->SetFont('THSarabun','',12);
$pdf->SetXY($x1+10,4+$h*23);
$pdf->Write(10,'¨Ó¹Ç¹ÊÁÃÃ¶¹ÐËÅÑ¡ /ÊÁÃÃ¶¹Ðà©¾ÒÐµÒÁÅÑ¡É³Ð§Ò¹·Õè»¯ÔºÑµÔ /ÊÁÃÃ¶¹Ð·Ò§¡ÒÃºÃÔËÒÃ ·ÕèÁÕÃÐ´ÑºÊÁÃÃ¶¹Ð·ÕèáÊ´§ÍÍ¡ ÊÙ§¡ÇèÒËÃ×Íà·èÒ¡Ñº ÃÐ´ÑºÊÁÃÃ¶¹Ð·Õè¤Ò´ËÇÑ§ X 3 ¤Ðá¹¹');
$pdf->SetXY($x1+10,4+$h*24);
$pdf->Write(10,'¨Ó¹Ç¹ÊÁÃÃ¶¹ÐËÅÑ¡ /ÊÁÃÃ¶¹Ðà©¾ÒÐµÒÁÅÑ¡É³Ð§Ò¹·Õè»¯ÔºÑµÔ /ÊÁÃÃ¶¹Ð·Ò§¡ÒÃºÃÔËÒÃ ·ÕèÁÕÃÐ´ÑºÊÁÃÃ¶¹Ð·ÕèáÊ´§ÍÍ¡ µèÓ¡ÇèÒ ÃÐ´ÑºÊÁÃÃ¶¹Ð·Õè¤Ò´ËÇÑ§ 1 ÃÐ´Ñº X 2 ¤Ðá¹¹');
$pdf->SetXY($x1+10,4+$h*25);
$pdf->Write(10,'¨Ó¹Ç¹ÊÁÃÃ¶¹ÐËÅÑ¡ /ÊÁÃÃ¶¹Ðà©¾ÒÐµÒÁÅÑ¡É³Ð§Ò¹·Õè»¯ÔºÑµÔ /ÊÁÃÃ¶¹Ð·Ò§¡ÒÃºÃÔËÒÃ ·ÕèÁÕÃÐ´ÑºÊÁÃÃ¶¹Ð·ÕèáÊ´§ÍÍ¡ µèÓ¡ÇèÒ ÃÐ´ÑºÊÁÃÃ¶¹Ð·Õè¤Ò´ËÇÑ§ 2 ÃÐ´Ñº X 1 ¤Ðá¹¹');
$pdf->SetXY($x1+10,4+$h*26);
$pdf->Write(10,'¨Ó¹Ç¹ÊÁÃÃ¶¹ÐËÅÑ¡ /ÊÁÃÃ¶¹Ðà©¾ÒÐµÒÁÅÑ¡É³Ð§Ò¹·Õè»¯ÔºÑµÔ /ÊÁÃÃ¶¹Ð·Ò§¡ÒÃºÃÔËÒÃ ·ÕèÁÕÃÐ´ÑºÊÁÃÃ¶¹Ð·ÕèáÊ´§ÍÍ¡ µèÓ¡ÇèÒ ÃÐ´ÑºÊÁÃÃ¶¹Ð·Õè¤Ò´ËÇÑ§ 3 ÃÐ´Ñº X 0 ¤Ðá¹¹');

$pdf->SetFont('THSarabun','',13);
$pdf->SetXY($x1+220,4+$h*27);
$pdf->Write(10,'(8) ¼ÅÃÇÁ¤Ðá¹¹');
$pdf->SetXY($x1+10,4+$h*28);
$pdf->Write(10,'   (9) ÊÃØ»¤Ðá¹¹ÊèÇ¹¾ÄµÔ¡ÃÃÁ¡ÒÃ»¯ÔºÑµÔÃÒª¡ÒÃ   (ÊÁÃÃ¶¹Ð)   =                            ¼ÅÃÇÁ¤Ðá¹¹ ã¹ (8)');
$pdf->SetXY($x1+10,4+$h*29);
$pdf->Write(10,'                                                                                              ¨Ó¹Ç¹ÊÁÃÃ¶¹Ð·Õèãªéã¹¡ÒÃ»ÃÐàÁÔ¹ X 3 ¤Ðá¹¹');
$pdf->SetXY(130,189);
$pdf->Write(0,'Ë¹éÒ·Õè  1 ¨Ò¡ 2 Ë¹éÒ');//. $narray.' array');



$query = "SELECT * FROM `behavior2` where   userid  = '$id' ";
$result = mysql_query($query);
if($r2 = mysql_fetch_assoc($result))
{
$x1=58;

$pdf->SetXY($x1+10,4+$h*10);
$pdf->Write(10,'5                '.$r2['beh11']);
$pdf->SetXY($x1+10,4+$h*11);
$pdf->Write(10,'5                '.$r2['beh12']);
$pdf->SetXY($x1+10,4+$h*12);
$pdf->Write(10,'5                '.$r2['beh13']);
$pdf->SetXY($x1+10,4+$h*13);
//$pdf->Write(10,'5                '.$r2['beh14']);
$pdf->SetXY($x1+10,4+$h*14);
$pdf->Write(10,'5                '.$r2['beh14']);
$pdf->SetXY($x1+10,4+$h*16);
$pdf->Write(10,'5                '.$r2['beh15']);

$x1=58;

$pdf->SetXY($x1+101,4+$h*10);
$pdf->Write(10,'5                '.$r2['beh21']);
$pdf->SetXY($x1+101,4+$h*11);
$pdf->Write(10,'5                '.$r2['beh22']);
$pdf->SetXY($x1+101,4+$h*12);
$pdf->Write(10,'5                '.$r2['beh23']);
$pdf->SetXY($x1+101,4+$h*13);
$pdf->Write(10,'5                '.$r2['beh24']);
$pdf->SetXY($x1+101,4+$h*14);
$pdf->Write(10,'5                '.$r2['beh25']);
$pdf->SetXY($x1+101,4+$h*15);
$pdf->Write(10,'5                '.$r2['beh26']);

$level[1]=0;
$level[2]=0;
$level[3]=0;
$level[4]=0;
$level[5]=0;

$level[$r2['beh11']]++;
$level[$r2['beh12']]++;
$level[$r2['beh13']]++;
$level[$r2['beh14']]++;
$level[$r2['beh15']]++;

$level[$r2['beh21']]++;
$level[$r2['beh22']]++;
$level[$r2['beh23']]++;
$level[$r2['beh24']]++;
$level[$r2['beh25']]++;
$level[$r2['beh26']]++;

$x1=127;
$h=6;
$pdf->SetXY($x1+101,4+$h*23);$pdf->Write(10,$level[5]);
$pdf->SetXY($x1+121,4+$h*23);$pdf->Write(10,"3");
$pdf->SetXY($x1+141,4+$h*23);$pdf->Write(10,$level[5]*3);
$pdf->SetXY($x1+101,4+$h*24);$pdf->Write(10,$level[4]);
$pdf->SetXY($x1+121,4+$h*24);$pdf->Write(10,"2");
$pdf->SetXY($x1+141,4+$h*24);$pdf->Write(10,$level[4]*2);
$pdf->SetXY($x1+101,4+$h*25);$pdf->Write(10,$level[3]);
$pdf->SetXY($x1+121,4+$h*25);$pdf->Write(10,"1");
$pdf->SetXY($x1+141,4+$h*25);$pdf->Write(10,$level[3]);
$pdf->SetXY($x1+101,4+$h*26);
$pdf->Write(10,$level[2]+$level[1]."                  0                   0");
$pdf->SetXY($x1+141,4+$h*27);
$pdf->Write(10,$level[5]*3+$level[4]*2+$level[3]);
$pdf->SetXY($x1+135,4+$h*28);
$pdf->Write(10,round(($level[5]*3+$level[4]*2+$level[3])/33,2) ."(àµçÁ1)");
$pdf->SetXY($x1+110,4+$h*29);
$pdf->Write(10,round(($level[5]*3+$level[4]*2+$level[3])/33,2)*(100-$percent)."%(àµçÁ".(100-$percent)."%)");

}
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

$pdf->AddPage();



$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.5);

$x1=15;
$y1=5;
$x2=285;
$y2=45;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);

$x1=15;
$y1=50;
$x2=285;
$y2=170;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);

$pdf->SetLineWidth(.1);

$pdf->SetTextColor(0,0,0); 

$pdf->AddFont('THSarabun','','THSarabun.php');//¸ÃÃÁ´Ò
$pdf->SetFont('THSarabun','',13);

$h=7;


//$pdf->SetXY(25,4+$h*1);
$pdf->SetLeftMargin(18);
$pdf->Write(5,'(10) ¼Ùé»ÃÐàÁÔ¹áÅÐ¼ÙéÃÑº¡ÒÃ»ÃÐàÁÔ¹ ä´éµ¡Å§ÃèÇÁ¡Ñ¹áÅÐàËç¹¾éÍ§¡Ñ¹áÅéÇ (ÃÐºØ¢éÍÁÙÅã¹ (1) áÅÐËÃ×Í (3) áÅÐËÃ×Í (5) µÒÁÃÐ´ÑºÊÁÃÃ¶¹Ð¢Í§µÓáË¹è§·Õè¡ÓË¹´ãËé¤Ãº) ¨Ö§Å§ÅÒÂÁ×Íª×èÍäÇéà»ç¹ËÅÑ¡°Ò¹ (Å§¹ÒÁàÁ×èÍ¨Ñ´·Ó¢éÍµ¡Å§)');
//$pdf->SetMargins(1,1,200);


$pdf->SetXY(15,4+$h*3);
$pdf->Write(10,'           ÅÒÂÁ×Íª×èÍ………………………………………………………………(¼Ùé»ÃÐàÁÔ¹)                      ÅÒÂÁ×Íª×èÍ………………………………………………………………(¼ÙéÃÑº¡ÒÃ»ÃÐàÁÔ¹)                     ');
$pdf->SetXY(15,4+$h*4);
$pdf->Write(10,'             ÇÑ¹·Õè………….à´×Í¹……………………………………..¾.È………………………                          ÇÑ¹·Õè………….à´×Í¹……………………………………..¾.È………………………');

$pdf->SetXY(15,4+$h*7);
$pdf->Write(10,'   (11) ¤ÇÒÁàËç¹à¾ÔèÁàµÔÁ¢Í§¼Ùé»ÃÐàÁÔ¹ (ÃÐºØ¢éÍÁÙÅàÁ×èÍÊÔé¹ÃÍº¡ÒÃ»ÃÐàÁÔ¹) ');
$pdf->SetXY(15,4+$h*8);
$pdf->Write(10,'              1) ¨Ø´à´è¹ áÅÐ/ËÃ×Í ÊÔè§·Õè¤ÇÃ»ÃÑº»ÃØ§á¡éä¢    ………………………………………...….….….………...…………………………………...……………………………………......…………………………………………………………......……………………');
$pdf->SetXY(15,4+$h*9);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*10);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*11);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*12);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*13);
$pdf->Write(10,'              2) ¢éÍàÊ¹Íá¹Ðà¡ÕèÂÇ¡ÑºÇÔ¸ÕÊè§àÊÃÔÁáÅÐ¾Ñ²¹Ò à¾×èÍ¨Ñ´·Óá¼¹¾Ñ²¹ÒÃÒÂºØ¤¤Å   ….……...….….….………...…………………………………...………......……………………....................………………………………......……………………');
$pdf->SetXY(15,4+$h*14);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*15);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*16);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*17);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');


$pdf->SetXY(15,4+$h*19);
$pdf->Write(10,'   (12) ¼Ùé»ÃÐàÁÔ¹áÅÐ¼ÙéÃÑº¡ÒÃ»ÃÐàÁÔ¹ ä´éàËç¹ªÍº¼Å¡ÒÃ»ÃÐàÁÔ¹áÅéÇ (ÃÐºØ¢éÍÁÙÅã¹ (2) áÅÐËÃ×Í (4) áÅÐËÃ×Í (6) (7) (8) (9) áÅÐ (11) ãËé¤Ãº) ¨Ö§Å§ÅÒÂÁ×Íª×èÍäÇéà»ç¹ËÅÑ¡°Ò¹  (Å§¹ÒÁàÁ×èÍÊÔé¹ÃÍº¡ÒÃ»ÃÐàÁÔ¹)');
$pdf->SetXY(15,4+$h*21);
$pdf->Write(10,'           ÅÒÂÁ×Íª×èÍ………………………………………………………………(¼Ùé»ÃÐàÁÔ¹)                      ÅÒÂÁ×Íª×èÍ………………………………………………………………(¼ÙéÃÑº¡ÒÃ»ÃÐàÁÔ¹)                     ');
$pdf->SetXY(15,4+$h*22);
$pdf->Write(10,'             ÇÑ¹·Õè………….à´×Í¹……………………………………..¾.È………………………                          ÇÑ¹·Õè………….à´×Í¹……………………………………..¾.È………………………');


$pdf->SetXY(130,189);
$pdf->Write(0,'Ë¹éÒ·Õè  2 ¨Ò¡ 2 Ë¹éÒ');//. $narray.' array');

$pdf->Output();

?>.
