<?php
session_start();
if( $_SESSION[session_log]<>session_id())
{
header("Location: ../index.php");
exit();
}

include"../tools/connect-eval.php";
$id=$_GET['id'];

	    $Mquery = "SELECT * FROM  `staffinfo`  where staffinfo.staffid=".$_SESSION[session_user_id];
		$Mresult = mysql_query($Mquery);
		$Mrow = mysql_fetch_array($Mresult);

		if(!( $Mrow ['m']||$Mrow ['p']||$Mrow ['b']||$Mrow ['c']||$Mrow ['a']) )
		{  
				header("Location: ../index.php");
				exit();		
		}

define(‘FPDF_FONTPATH’,'font/');

$query = "SELECT * FROM `staffinfo`  where   staffid = '$id' ";
$result = mysql_query($query);
$r = mysql_fetch_assoc($result);

$query = "SELECT * FROM `dev`  where   devuserid= '$id' ";
$result = mysql_query($query);
$num_rows = mysql_num_rows($result);

require('fpdf.php');
 
$pdf=new FPDF( 'P' , 'mm' , 'A4' );
$pdf->AddPage();

$x1=15;
$y1=5;
$x2=285;
$y2=185;
$h=6;

$pdf->SetTextColor(0,0,0); 

$pdf->AddFont('THSarabun','','THSarabun.php');//ธรรมดา
$pdf->AddFont('THSarabun','b','THSarabun Bold.php');//หนา
$pdf->SetFont('THSarabun','',13);


$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.1);

$pdf->SetFont('THSarabun','b',16);

$pdf->SetXY(100,4+$h*2);
$pdf->Cell(10,10,'แบบสรุปการประเมินผลการปฎิบัติราชการ',0,1,'C');
$pdf->SetXY(100,4+$h*3);
$pdf->Cell(10,10,'ของข้าราชการพลเรือนและพนักงานในสถาบันอุดมศึกษา สังกัดมหาวิทยาลัยมหาสารคาม',0,1,'C');
$pdf->SetXY(100,4+$h*4);
$pdf->Cell(10,10,'*****************************',0,1,'C');
$pdf->SetXY(10,4+$h*5);
$pdf->Cell(10,10,'ส่วนที่ 1 ข้อมูลของผู้รับการประเมิน',0,1,'L');

$pdf->SetFont('THSarabun','',16);

$pdf->SetXY(20,8+$h*6);
$pdf->Cell(10,10,'รอบการประเมิน',0,1,'L');
$pdf->SetXY(60,8+$h*6);
//$pdf->Cell(15,10,'	วงรอบที่ 2 (1 มีนาคม พ.ศ. 2557 ถึง 31 สิงหาคม พ.ศ. 2557)',0,1,'L');
$pdf->SetXY(60,8+$h*7);
$pdf->Cell(15,10,'	 วงรอบที่ 1 ระหว่างวันที่ 1 มีนาคม - 31 สิงหาคม 2567   ',0,1,'L');

$pdf->SetXY(20,8+$h*9);
$pdf->Cell(10,10,'ชื่อผู้รับการประเมิน ',0,1,'L');
$pdf->SetXY(60,8+$h*9);
$pdf->Cell(15,10, $r['staffname'],0,1,'L');
$pdf->SetXY(60,8+$h*10);
$pdf->Cell(15,10,'ตำแหน่ง  : '. $r['staffposition'],0,1,'L');
$pdf->SetXY(60,8+$h*11);
$pdf->Cell(15,10,'ประเภทตำแหน่ง  : '. $r['staffcategory'],0,1,'L');
$pdf->SetXY(60,8+$h*12);
$pdf->Cell(15,10,'ระดับตำแหน่ง  : ',0,1,'L');
$pdf->SetXY(60,8+$h*13);
$pdf->Cell(15,10,'สังกัด  :  คณะวิทยาศาสตร์ มหาวิทยาลัยมหาสารคาม ',0,1,'L');

$pdf->SetXY(20,8+$h*15);
$pdf->Cell(10,10,'ชื่อผู้ประเมิน',0,1,'L');
$pdf->SetXY(60,8+$h*15);
$pdf->Cell(15,10, $r['commander'],0,1,'L');
$pdf->SetXY(60,8+$h*16);
$pdf->Cell(15,10, $r['commanderposition'],0,1,'L');

$pdf->SetFont('THSarabun','b',16);
$pdf->SetXY(12,8+$h*18);
$pdf->Cell(10,10,'คำชี้แจง',0,1,'L');
$pdf->SetFont('THSarabun','',16);

$pdf->SetXY(12,8+$h*19);
$pdf->Cell(10,10,'แบบสรุปการประเมินผลการปฏิบัติราชการนี้มีด้วยกัน 5 ส่วน ดังนี้',0,1,'L');
$pdf->SetXY(20,8+$h*20);
$pdf->Cell(10,10,'ส่วนที่ 1 ข้อมูลของผู้รับการประเมิน เพื่อระบุรายละเอียดต่างๆ ที่เกี่ยวข้องกับตัวผู้รับการประเมิน',0,1,'L');
$pdf->SetXY(20,8+$h*21);
$pdf->Cell(10,10,'ส่วนที่ 2 การสรุปผลการประเมิน ใช้เพื่อกรอกค่าคะแนนการประเมินในองค์ประกอบด้านผลสัมฤทธิ์ของงาน',0,1,'L');
$pdf->SetXY(20,8+$h*22);
$pdf->Cell(10,10,'           องค์ประกอบด้านพฤติกรรมการปฏิบัติราชการ และน้ำหนักของทั้งสององค์ประกอบในแบบสรุปส่วนที่ 2 นี้',0,1,'L');
$pdf->SetXY(20,8+$h*23);
$pdf->Cell(10,10,'           ยังใช้สำหรับคำนวณคะแนนผลการปฏิบัติราชการรวมด้วย',0,1,'L');
$pdf->SetXY(20,8+$h*24);
$pdf->Cell(10,10,'                    - สำหรับคะแนนองค์ประกอบด้านผลสัมฤทธิ์ของงาน ให้นำมาจากแบบประเมินผลสัมฤทธิ์ของงาน',0,1,'L');
$pdf->SetXY(20,8+$h*25);
$pdf->Cell(10,10,'                      โดยให้แนบท้ายแบบสรุปฉบับนี้',0,1,'L');
$pdf->SetXY(20,8+$h*26);
$pdf->Cell(10,10,'                    - สำหรับคะแนนองค์ประกอบด้านพฤติกรรมการปฏิบัติราชการ ให้นำมาจากแบบประเมิน',0,1,'L');
$pdf->SetXY(20,8+$h*27);
$pdf->Cell(10,10,'                      สมรรถนะโดยให้แนบท้ายแบบสรุปฉบับนี้',0,1,'L');
$pdf->SetXY(20,8+$h*28);
$pdf->Cell(10,10,'ส่วนที่ 3 แผนพัฒนาการปฏิบัติราชการรายบุคคล ผู้ประเมินและผู้รับการประเมินร่วมกันจัดทำแผนพัฒนา',0,1,'L');
$pdf->SetXY(20,8+$h*29);
$pdf->Cell(10,10,'           ผลการปฏิบัติราชการ',0,1,'L');
$pdf->SetXY(20,8+$h*30);
$pdf->Cell(10,10,'ส่วนที่ 4 การรับทราบผลการประเมิน ผู้รับการประเมินลงนามรับทราบผลการประเมิน',0,1,'L');
$pdf->SetXY(20,8+$h*31);
$pdf->Cell(10,10,'ส่วนที่ 5 ความเห็นของผู้บังคับบัญชาเหนือขึ้นไป ผู้บังคับบัญชาเหนือขึ้นไปกลั่นกรองผลการประเมิน',0,1,'L');
$pdf->SetXY(20,8+$h*32);
$pdf->Cell(10,10,'           แผนพัฒนาผลการปฏิบัติราชการ และให้ความเห็น',0,1,'L');

$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.1);

$x1=10;
$x2=200;
$y1=115;
$y2=220;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);

$pdf->SetFont('THSarabun','b',15);
$pdf->SetXY(145,4+$h*2);
//$pdf->Cell(10,10,'ชื่อผู้รับการประเมิน ...'. $r['staffname'].'....ตำแหน่ง/ระดับ ....'. $r['staffposition'].'... ',0,1,'C');
$pdf->SetXY(145,4+$h*3);
//$pdf->Cell(10,10,' สังกัด ...คณะวิทยาศาสตร์ มหาวิทยาลัยมหาสารคาม....       ระยะเวลาที่ดำรงตำแหน่ง ...'.$r['ptime'].'...   แผนพัฒนารายบุคคลประจำปี    ....2555....',0,1,'C');

$pdf->AddPage();

$pdf->SetXY(20,4+$h*0);
$pdf->Cell(10,10,'ส่วนที่ 2 การสรุปผลการประเมิน',0,1,'L');

$pdf->SetFont('THSarabun','',15);
$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.1);
$pdf->SetXY(55,6+$h*3);
$pdf->Cell(10,10,'องค์ประกอบการประเมิน',0,1,'C');
$pdf->SetXY(100,6+$h*3);
$pdf->MultiCell(30,5,'ค่าคะแนนที่ได้ หลังถ่วงน้ำหนัก (ก) ',0,'C');
$pdf->SetXY(130,6+$h*3);
$pdf->MultiCell(30,5,'สัดส่วนคะแนน (ข) ',0,'C');
$pdf->SetXY(160,6+$h*3);
$pdf->MultiCell(30,5,' สรุปคะแนน
(ก) X (ข) ',0,'C');

$sc7=($sc70*70);
$sc3=($sc30*30);
$sc100=$sc7+$sc3;
$pdf->SetXY(21,10+$h*5);
$pdf->MultiCell(78,5,'องค์ประกอบที่ 1 ผลสัมฤทธิ์ของงาน',0,'L');
$pdf->SetXY(110,10+$h*5);
//$pdf->MultiCell(78,5,$sc70,0,'L');
$pdf->SetXY(110,10+$h*5);
//$pdf->MultiCell(78,5,'                           70                      '.$sc7.'',0,'L');
$pdf->SetXY(21,10+$h*7);
$pdf->MultiCell(78,5,'องค์ประกอบที่ 2 พฤติกรรมการปฏิบัติราชการ',0,'L');
$pdf->SetXY(110,10+$h*7);
//$pdf->MultiCell(78,5,$sc30,0,'L');
//$pdf->SetXY(110,10+$h*7);
//$pdf->MultiCell(78,5,'                           30                     '.$sc3.'',0,'L');
$pdf->SetXY(21,10+$h*9);
$pdf->MultiCell(78,5,'องค์ประกอบอื่นๆ (ถ้ามี)',0,'L');
$pdf->SetXY(120,8+$h*11);
$pdf->MultiCell(78,5,'รวม             100               ',0,'L');
/*
if($sc100<60){
		$pdf->SetXY(30,8+$h*18);$pdf->MultiCell(100,10,' /',0,'L');
}elseif($sc100<70){
		$pdf->SetXY(30,8+$h*17);$pdf->MultiCell(100,10,' /',0,'L');
}elseif($sc100<80){
		$pdf->SetXY(30,8+$h*16);$pdf->MultiCell(100,10,' /',0,'L');
}elseif($sc100<90){
		$pdf->SetXY(30,8+$h*15);$pdf->MultiCell(100,10,' /',0,'L');
}else{
		$pdf->SetXY(30,8+$h*14);$pdf->MultiCell(100,10,' /',0,'L');
} 
*/
$pdf->SetXY(21,10+$h*13);
$pdf->MultiCell(78,5,'ระดับผลการประเมินที่ได้',0,'L');
$pdf->SetXY(30,8+$h*14);
$pdf->MultiCell(100,10,'	 ดีเด่น (90 - 100)',0,'L');
$pdf->SetXY(30,8+$h*15);
$pdf->MultiCell(100,10,'	 ดีมาก (80 – 89)',0,'L');
$pdf->SetXY(30,8+$h*16);
$pdf->MultiCell(100,10,'	 ดี (70 – 79)',0,'L');
$pdf->SetXY(30,8+$h*17);
$pdf->MultiCell(100,10,'	 พอใช้ (60 – 69)',0,'L');
$pdf->SetXY(30,8+$h*18);
$pdf->MultiCell(100,10,'	 ต้องปรับปรุง (ต่ำกว่า 60)',0,'L');

$x1=20;
$x2=190;
$y1=20;
$y2=81;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y2, $x2, $y2);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x2,$y1, $x2, $y2);

$pdf->Line($x1,$y1+$h*3, $x2, $y1+$h*3);
$pdf->Line($x1,$y1+$h*5, $x2, $y1+$h*5);
$pdf->Line($x1,$y1+$h*7, $x2, $y1+$h*7);
$pdf->Line($x1,$y1+$h*9, $x2, $y1+$h*9);
// $pdf->Line($x1,$y1+$h*10, $x2, $y1+$h*10);

$pdf->Line($x1+80,$y1, $x1+80, $y2-7);
$pdf->Line($x1+110,$y1, $x1+110, $y2);
$pdf->Line($x1+140,$y1, $x1+140, $y2);
$pdf->AddPage();
$i=0;
$page=0;
$total=round(($num_rows+2) /4)+1;
while($r2 = mysql_fetch_assoc($result))
{

if($i==0)
{
$page++;
$pdf->SetFont('THSarabun','b',16);
$pdf->SetXY(10,4+$h*3);
$s="ส่วนที่ 3 แผนพัฒนาการปฏิบัติราชการรายบุคคล";
$pdf->MultiCell( 150 , 5 , $s ,0,'L');
$pdf->SetFont('THSarabun','',13);

$pdf->SetXY(15,4+$h*5);
$s="ความรู้/ทักษะ/สมรรถนะ
ที่ต้องการพัฒนา";
$pdf->MultiCell( 50 , 5 , $s ,0,'C');

$pdf->SetXY(95,4+$h*5);
$s="วิธีการพัฒนา";
$pdf->MultiCell( 50 , 5 , $s ,0,'C');

$pdf->SetXY(170,4+$h*5);
$s="ช่วงเวลาที่
ต้องการพัฒนา";
$pdf->MultiCell( 20 , 5 , $s ,0,'C');



$x1=0;
$y1=20;
$x2=210;
$y2=48;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);

$pdf->Line($x1+10,$y1+10, $x1+10, $y2);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2);

$pdf->Line(10,$y1+10+$h*3, 200, $y1+10+$h*3);
$pdf->Line(80,$y1+10, 80, $y2);
$pdf->Line(160,$y1+10, 160, $y2);

//$pdf->Line($x1+100,$y1+10+$h*10, $x1+170, $y1+10+$h*10);

$pdf->SetXY(250,10);
//$pdf->Write(0,'หน้าที่  '.$pdf->PageNo().'  จาก '.$total.' หน้า');//. $narray.' array');

}

	$s=$r2['subj'];
	$pdf->SetXY(10,50+6*$h*$i);
	$pdf->MultiCell( 70 , 5 , $s );        
	$s=$r2['method'];
	$pdf->SetXY(80,50+6*$h*$i);
	$pdf->MultiCell( 78 , 5 , $s);        
	$s=$r2['ptime'];
	$pdf->SetXY(160,50+6*$h*$i);
	$pdf->MultiCell( 38 , 5 , $s );        
	$x1=0;

$y1=48;
$x2=210;
$y2=85;
$h=6;

$pdf->Line($x1+10,$y2+$i*35, $x2-10, $y2+$i*35);
$pdf->Line($x1+10,$y1+$i*35, $x1+10, $y2+$i*35);
$pdf->Line($x2-10,$y1+$i*35, $x2-10, $y2+$i*35);

$pdf->Line(80,$y1+$i*35, 80, $y2+$i*35);
$pdf->Line(160,$y1+$i*35, 160, $y2+$i*35);

	$i++;

	if(($i>=6)||(($i+($page-1)*6)==$num_rows))
	{
	   $i=0;
      $pdf->AddPage();
	}

}

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

$pdf->SetDrawColor(0,0,0); 

$pdf->SetLineWidth(.1);

$pdf->SetTextColor(0,0,0); 

$x1=10;
$x2=200;
$y1=15;
$y2=120;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x1+120,$y1, $x1+120, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);
$pdf->Line($x1,$y1+$h*5, $x2, $y1+$h*5);



$x1=10;
$x2=200;
$y1=135;
$y2=240;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x1+120,$y1, $x1+120, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);
$pdf->Line($x1,$y1+$h*9, $x2, $y1+$h*9);

$pdf->SetFont('THSarabun','b',16);

	$s="ส่วนที่ 4 การรับทราบผลการประเมิน";
	$pdf->SetXY(15,$h*1);
	$pdf->MultiCell( 70 , 5 , $s );        
	$s="ผู้รับการประเมิน";
	$pdf->SetXY(15,$h*3);
	$pdf->MultiCell( 70 , 5 , $s );        
	$s="ผู้ประเมิน";
	$pdf->SetXY(15,$h*8);
	$pdf->MultiCell( 70 , 5 , $s );        

	$s="ส่วนที่ 5 ความเห็นของผู้บังคับบัญชาเหนือขึ้นไป";
	$pdf->SetXY(15,$h*21);
	$pdf->MultiCell( 100 , 5 , $s );        

	$s="ผู้บังคับบัญชาเหนือขึ้นไป";
	$pdf->SetXY(15,$h*23);
	$pdf->MultiCell( 100 , 5 , $s );        

	$s="ผู้บังคับบัญชาเหนือขึ้นไปอีกชั้นหนึ่ง (ถ้ามี)";
	$pdf->SetXY(15,$h*32);
	$pdf->MultiCell( 100 , 5 , $s );        

$pdf->SetFont('THSarabun','',14);

	$pdf->SetXY(20,$h*4);
	$s='	 ได้รับทราบผลการประเมินและแผนพัฒนาการปฏิบัติราชการรายบุคคลแล้ว';
	$pdf->MultiCell( 120 , 6 , $s );        
	$pdf->SetXY(135,$h*4);
	$s='ลงชื่อ ...............................................................
ตำแหน่ง ..........................................................
วันที่.................................................................';
	$pdf->MultiCell( 80 , 6 , $s );        

	$pdf->SetXY(20,$h*9);
	$s='	 ได้แจ้งผลการประเมินและผู้รับการประเมินได้ลงนามรับทราบรายบุคคลแล้ว';
	$pdf->MultiCell( 120 , 6 , $s );        
	
	$pdf->SetXY(20,$h*10);
	$s='	 ได้แจ้งผลการประเมินเมื่อวันที่..................................................................';
	$pdf->MultiCell( 120 , 6 , $s );        
	
	$pdf->SetXY(20,$h*11);
	$s='     แต่ผู้รับการประเมินไม่ลงนามรับทราบผลการประเมิน';
	$pdf->MultiCell( 120 , 6 , $s );        
	$pdf->SetXY(20,$h*12);
	$s='     โดยมี .................................................................. เป็นพยาน';
	$pdf->MultiCell( 120 , 6 , $s );        
	
	$pdf->SetXY(135,$h*9);
	$s='ลงชื่อ ...............................................................
ตำแหน่ง ..........................................................
วันที่.................................................................';
	$pdf->MultiCell( 80 , 6 , $s );        

	$pdf->SetXY(135,$h*24);
	$s='ลงชื่อ ...............................................................
ตำแหน่ง ..........................................................
วันที่.................................................................';
	$pdf->MultiCell( 80 , 6 , $s );        

	$pdf->SetXY(135,$h*33);
	$s='ลงชื่อ ...............................................................
ตำแหน่ง ..........................................................
วันที่.................................................................';
	$pdf->MultiCell( 80 , 6 , $s );        

	$pdf->SetXY(20,$h*15);
	$s='ลงชื่อ ....................................................
ตำแหน่ง ................................................
วันที่........................................................';
	$pdf->MultiCell( 80 , 6 , $s );        

	$pdf->SetXY(70,$h*15);
	$s='ลงชื่อ ....................................................
ตำแหน่ง ................................................
วันที่........................................................';
	$pdf->MultiCell( 80 , 6 , $s );        	

	$pdf->SetXY(20,$h*24);
	$s='	 เห็นด้วยกับผลการประเมิน';
	$pdf->MultiCell( 120 , 6 , $s );        
	
	$pdf->SetXY(20,$h*25);
	$s='	 มีความเห็นต่าง ดังนี้';
	$pdf->MultiCell( 120 , 6 , $s );        

	$pdf->SetXY(20,$h*26);
	$s=' ................................................................................................................................
 ...............................................................................................................................
 ...............................................................................................................................
 ...............................................................................................................................
................................................................................................................................';
	$pdf->MultiCell( 110 , 6 , $s );        
	
	
	$pdf->SetXY(20,$h*33);
	$s='	 เห็นด้วยกับผลการประเมิน';
	$pdf->MultiCell( 120 , 6 , $s );        
	
	$pdf->SetXY(20,$h*34);
	$s='	 มีความเห็นต่าง ดังนี้';
	$pdf->MultiCell( 120 , 6 , $s );        

	$pdf->SetXY(20,$h*35);
	$s=' ................................................................................................................................
 ...............................................................................................................................
 ...............................................................................................................................
 ...............................................................................................................................
................................................................................................................................';
	$pdf->MultiCell( 110 , 6 , $s );        
	
    $pdf->Output();

?>.
