<?php

session_start();

include"../tools/connect-eval.php";

$query = "SELECT * FROM `staffinfo`  where   staffid = '$_SESSION[session_user_id] ' ";
$result = mysql_query($query);
$r = mysql_fetch_assoc($result);
$smajor=$r['staffmajor'];		

require('fpdf.php');
 
$pdf=new FPDF( 'L' , 'mm' , 'A4' );
$pdf->AddPage();

$x1=15;
$y1=5;
$x2=285;
$y2=185;
$h=6;

$pdf->SetTextColor(0,0,0); 

$pdf->AddFont('THSarabun','','THSarabun.php');//ธรรมดา
$pdf->AddFont('THSarabun','b','THSarabun Bold.php');//หนา
$pdf->SetFont('THSarabun','',13);


$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.1);

$pdf->SetFont('THSarabun','b',15);

$pdf->SetXY(15,4+$h*0);
$pdf->Write(10,'                            ข้อตกลงและแบบการประเมินพฤติกรรมการปฏิบัติราชการของข้าราชการและพนักงาน  สังกัดมหาวิทยาลัยมหาสารคาม (องค์ประกอบที่ 2)                แบบ ป.02');
$pdf->SetXY(15,4+$h*1);
$pdf->Write(10,'                                                                  รอบการประเมิน      วงรอบที่ 1 ระหว่างวันที่ 1 มีนาคม - 31 สิงหาคม 2567   ');
$pdf->SetXY(145,4+$h*2);
//$pdf->Write(10,'                 ชื่อผู้รับการประเมิน ...'. $r['staffname'].'....ตำแหน่ง/ระดับ ....'. $r['staffposition'].'... สังกัด คณะวิศวกรรมศาสตร์ มหาวิทยาลัยมหาสารคาม ');
$pdf->Cell(10,10,'ชื่อผู้รับการประเมิน ...'. $r['staffname'].'....ตำแหน่ง/ระดับ ....'. $r['staffposition'].'... สังกัด คณะวิศวกรรมศาสตร์ มหาวิทยาลัยมหาสารคาม ',0,1,'C');
$pdf->SetXY(145,4+$h*3);
//$pdf->Write(10,'                 ชื่อผู้บังคับบัญชา/ผู้ประเมิน ......'. $r['commander'].'.......  ตำแหน่ง/ระดับ .......'. $r['commanderposition'].'....... ');
$pdf->Cell(10,10,'ชื่อผู้บังคับบัญชา/ผู้ประเมิน ......'. $r['commander'].'.......  ตำแหน่ง/ระดับ .......'. $r['commanderposition'].'.......',0,1,'C');

$pdf->SetFont('THSarabun','',13);
$pdf->SetXY(15,4+$h*5);
$pdf->Write(10,'            ก. สมรรถนะหลัก                 (1) ระดับ       (2) ระดับ                      ข. สมรรถนะเฉพาะตาม           (3) ระดับ        (4) ระดับ');
$pdf->SetXY(15,4+$h*6);
$pdf->Write(10,'         (สำหรับข้าราชการและ             สมรรถนะ      สมรรถนะ                         ลักษณะงานที่ปฏิบัติ           สมรรถนะ         สมรรถนะ');
$pdf->SetXY(15,4+$h*7);
$pdf->Write(10,'            พนักงาน ทุกคน)                ที่คาดหวัง       ที่แสดงออก               (สำหรับข้าราชการและพนักงาน       ที่คาดหวัง       ที่แสดงออก');
$pdf->SetXY(15,4+$h*8);
$pdf->Write(10,'                                                                                                เฉพาะตามตำแหน่งที่รับผิดชอบ');
$pdf->SetXY(15,4+$h*9);
$pdf->Write(10,'                                                                                                       ตามที่ ก.บ.ม. กำหนด)');
$pdf->SetXY($x1+5,4+$h*10);
$pdf->Write(10,'ก. 1 การมุ่งผลสัมฤทธิ์');
$pdf->SetXY($x1+5,4+$h*11);
$pdf->Write(10,'ก. 2 การบริการที่ดี');
$pdf->SetXY($x1+5,4+$h*12);
$pdf->Write(10,'ก. 3 การสั่งสมความเชี่ยวชาญ');
$pdf->SetXY($x1+5,4+$h*13);
$pdf->Write(10,'         ในงานอาชีพ');
$pdf->SetXY($x1+5,4+$h*14);
$pdf->Write(10,'ก. 4 การยึดมั่นในความถูกต้อง');
$pdf->SetXY($x1+5,4+$h*15);
$pdf->Write(10,'      ชอบธรรมและจริยธรรม');
$pdf->SetXY($x1+5,4+$h*16);
$pdf->Write(10,'ก. 5 การทำงานเป็นทีม');


$x1=10;
$y1=25;
$x2=110;
$y2=103;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
//$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
//$pdf->Line($x1+10,$y1+10+$h*10, $x2-10, $y1+10+$h*10);
$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+10,$y1+10+$h*13, $x2-10, $y1+10+$h*13);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+50,$y1+10, $x1+50, $y2+10);
$pdf->Line($x1+70,$y1+10, $x1+70, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$x1=100;
$y1=25;
$x2=200;
$y2=103;
$h=6;

$pdf->SetXY($x1+10,4+$h*10);
$pdf->Write(10,'ข.1 การคิดวิเคราะห์');
$pdf->SetXY($x1+10,4+$h*11);
$pdf->Write(10,'ข.2 การดำเนินการเชิงรุก');
$pdf->SetXY($x1+10,4+$h*12);
$pdf->Write(10,'ข.3 ความผูกพันที่มีต่อส่วนราชการ');
$pdf->SetXY($x1+10,4+$h*13);
$pdf->Write(10,'ข.4 การมองภาพองค์รวม');
$pdf->SetXY($x1+10,4+$h*14);
$pdf->Write(10,'ข.5 การใส่ใจและพัฒนาผู้อื่น');
$pdf->SetXY($x1+10,4+$h*15);
$pdf->Write(10,'ข.6  ความเข้าใจผู้อื่น');





$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
$pdf->Line($x1+10,$y1+10+$h*10, $x2-10, $y1+10+$h*10);
//$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+10,$y1+10+$h*13, $x2-10, $y1+10+$h*13);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+53,$y1+10, $x1+53, $y2+10);
$pdf->Line($x1+70,$y1+10, $x1+70, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$x1=190;
$y1=25;
$x2=290;
$y2=103;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
$pdf->Line($x1+10,$y1+10+$h*10, $x2-10, $y1+10+$h*10);
$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+10,$y1+10+$h*13, $x2-10, $y1+10+$h*13);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+50,$y1+10, $x1+50, $y2+10);
$pdf->Line($x1+70,$y1+10, $x1+70, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$x1=10;
$y1=110;
$x2=290;
$y2=176;
$h=6;

$pdf->Line($x1+10,$y1+10, $x2-10, $y1+10);
$pdf->Line($x1+10,$y1+10+$h*4, $x2-10, $y1+10+$h*4);
$pdf->Line($x1+10,$y1+10+$h*5, $x2-10, $y1+10+$h*5);
$pdf->Line($x1+10,$y1+10+$h*6, $x2-10, $y1+10+$h*6);
$pdf->Line($x1+10,$y1+10+$h*7, $x2-10, $y1+10+$h*7);
$pdf->Line($x1+10,$y1+10+$h*8, $x2-10, $y1+10+$h*8);
$pdf->Line($x1+10,$y1+10+$h*9, $x2-10, $y1+10+$h*9);
$pdf->Line($x1+10,$y1+10+$h*11, $x2-10, $y1+10+$h*11);
$pdf->Line($x1+210,$y1+19, $x2-10, $y1+19);
$pdf->Line($x1+10,$y1+10, $x1+10, $y2+10);
$pdf->Line($x1+210,$y1+10, $x1+210, $y2-8);
$pdf->Line($x1+230,$y1+19, $x1+230, $y2-8);
$pdf->Line($x1+250,$y1+19, $x1+250, $y2+10);
$pdf->Line($x2-10,$y1+10, $x2-10, $y2+10);

$pdf->Line($x1+100,$y1+10+$h*10, $x1+170, $y1+10+$h*10);

$x1=10;
$y1=25;
$x2=200;
$y2=103;
$h=6;

$pdf->SetXY($x1+10,6+$h*19);
$pdf->Write(10,'                                                                                                                                                                                                                             (7) การประเมิน');
$pdf->SetXY($x1+10,8+$h*20);
$pdf->Write(10,'                                                                                                                                                                                                              จำนวน           คูณด้วย           คะแนน');
$pdf->SetXY($x1+10,8+$h*21);
$pdf->Write(10,'                                                                                                                                                                                                            สมรรถนะ');
$pdf->SetXY($x1+10,6+$h*20);
$pdf->Write(10,'                                                                                       เกณฑ์การประเมิน');

$pdf->SetFont('THSarabun','',12);
$pdf->SetXY($x1+10,4+$h*23);
$pdf->Write(10,'จำนวนสมรรถนะหลัก /สมรรถนะเฉพาะตามลักษณะงานที่ปฏิบัติ /สมรรถนะทางการบริหาร ที่มีระดับสมรรถนะที่แสดงออก สูงกว่าหรือเท่ากับ ระดับสมรรถนะที่คาดหวัง X 3 คะแนน');
$pdf->SetXY($x1+10,4+$h*24);
$pdf->Write(10,'จำนวนสมรรถนะหลัก /สมรรถนะเฉพาะตามลักษณะงานที่ปฏิบัติ /สมรรถนะทางการบริหาร ที่มีระดับสมรรถนะที่แสดงออก ต่ำกว่า ระดับสมรรถนะที่คาดหวัง 1 ระดับ X 2 คะแนน');
$pdf->SetXY($x1+10,4+$h*25);
$pdf->Write(10,'จำนวนสมรรถนะหลัก /สมรรถนะเฉพาะตามลักษณะงานที่ปฏิบัติ /สมรรถนะทางการบริหาร ที่มีระดับสมรรถนะที่แสดงออก ต่ำกว่า ระดับสมรรถนะที่คาดหวัง 2 ระดับ X 1 คะแนน');
$pdf->SetXY($x1+10,4+$h*26);
$pdf->Write(10,'จำนวนสมรรถนะหลัก /สมรรถนะเฉพาะตามลักษณะงานที่ปฏิบัติ /สมรรถนะทางการบริหาร ที่มีระดับสมรรถนะที่แสดงออก ต่ำกว่า ระดับสมรรถนะที่คาดหวัง 3 ระดับ X 0 คะแนน');

$pdf->SetFont('THSarabun','',13);
$pdf->SetXY($x1+220,4+$h*27);
$pdf->Write(10,'(8) ผลรวมคะแนน');
$pdf->SetXY($x1+10,4+$h*28);
$pdf->Write(10,'   (9) สรุปคะแนนส่วนพฤติกรรมการปฏิบัติราชการ   (สมรรถนะ)   =                            ผลรวมคะแนน ใน (8)');
$pdf->SetXY($x1+10,4+$h*29);
$pdf->Write(10,'                                                                                              จำนวนสมรรถนะที่ใช้ในการประเมิน X 3 คะแนน');
$pdf->SetXY(130,189);
$pdf->Write(0,'หน้าที่  1 จาก 2 หน้า');//. $narray.' array');

$x1=58;


$query = "SELECT * FROM `behavior2` where   userid  = '$_SESSION[session_user_id] ' ";
$result = mysql_query($query);
$r2 = mysql_fetch_assoc($result);

$pdf->SetXY($x1+10,4+$h*10);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+10,4+$h*11);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+10,4+$h*12);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+10,4+$h*14);
 $pdf->Write(10,'5 ');
$pdf->SetXY($x1+10,4+$h*16);
 $pdf->Write(10,'5 ');

$x1=58;

$pdf->SetXY($x1+101,4+$h*10);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+101,4+$h*11);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+101,4+$h*12);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+101,4+$h*13);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+101,4+$h*14);
 $pdf->Write(10,'5');
$pdf->SetXY($x1+101,4+$h*15);
  $pdf->Write(10,'5');

//if($r2 = mysql_fetch_assoc($result))
//if(1==0)
if($smajor=='ภาควิชาฟิสิกส์') 
{
$pdf->SetXY($x1+10,4+$h*10);
$pdf->Write(10,'                     '.$r2['beh11']);
$pdf->SetXY($x1+10,4+$h*11);
$pdf->Write(10,'                     '.$r2['beh12']);
$pdf->SetXY($x1+10,4+$h*12);
$pdf->Write(10,'                     '.$r2['beh13']);
$pdf->SetXY($x1+10,4+$h*14);
$pdf->Write(10,'                     '.$r2['beh14']);
$pdf->SetXY($x1+10,4+$h*16);
$pdf->Write(10,'                     '.$r2['beh15']);

$x1=58;

$pdf->SetXY($x1+101,4+$h*10);
$pdf->Write(10,'                     '.$r2['beh21']);
$pdf->SetXY($x1+101,4+$h*11);
$pdf->Write(10,'                     '.$r2['beh22']);
$pdf->SetXY($x1+101,4+$h*12);
$pdf->Write(10,'                     '.$r2['beh23']);
$pdf->SetXY($x1+101,4+$h*13);
$pdf->Write(10,'                     '.$r2['beh24']);
$pdf->SetXY($x1+101,4+$h*14);
$pdf->Write(10,'                     '.$r2['beh25']);
$pdf->SetXY($x1+101,4+$h*15);
$pdf->Write(10,'                     '.$r2['beh26']);

$level[1]=0;
$level[2]=0;
$level[3]=0;
$level[4]=0;
$level[5]=0;

$level[$r2['beh11']]++;
$level[$r2['beh12']]++;
$level[$r2['beh13']]++;
$level[$r2['beh14']]++;
$level[$r2['beh15']]++;

$level[$r2['beh21']]++;
$level[$r2['beh22']]++;
$level[$r2['beh23']]++;
$level[$r2['beh24']]++;
$level[$r2['beh25']]++;
$level[$r2['beh26']]++;

$x1=127;
$h=6;
$pdf->SetXY($x1+101,4+$h*23);$pdf->Write(10,$level[5]);
$pdf->SetXY($x1+121,4+$h*23);$pdf->Write(10,"3");
$pdf->SetXY($x1+141,4+$h*23);$pdf->Write(10,$level[5]*3);
$pdf->SetXY($x1+101,4+$h*24);$pdf->Write(10,$level[4]);
$pdf->SetXY($x1+121,4+$h*24);$pdf->Write(10,"2");
$pdf->SetXY($x1+141,4+$h*24);$pdf->Write(10,$level[4]*2);
$pdf->SetXY($x1+101,4+$h*25);$pdf->Write(10,$level[3]);
$pdf->SetXY($x1+121,4+$h*25);$pdf->Write(10,"1");
$pdf->SetXY($x1+141,4+$h*25);$pdf->Write(10,$level[3]);
$pdf->SetXY($x1+101,4+$h*26);
$pdf->Write(10,$level[2]+$level[1]."                  0                   0");
$pdf->SetXY($x1+141,4+$h*27);
$pdf->Write(10,$level[5]*3+$level[4]*2+$level[3]);
$pdf->SetXY($x1+135,4+$h*28);
$pdf->Write(10,round(($level[5]*3+$level[4]*2+$level[3])/33,2).'(เต็ม1)' );
}
				  
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

$pdf->AddPage();



$pdf->SetDrawColor(0,0,0); 
$pdf->SetLineWidth(.5);

$x1=15;
$y1=5;
$x2=285;
$y2=45;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);

$x1=15;
$y1=50;
$x2=285;
$y2=170;
$h=6;

$pdf->Line($x1,$y1, $x2, $y1);
$pdf->Line($x1,$y1, $x1, $y2);
$pdf->Line($x2,$y1, $x2, $y2);
$pdf->Line($x1,$y2, $x2, $y2);

$pdf->SetLineWidth(.1);

$pdf->SetTextColor(0,0,0); 

$pdf->AddFont('THSarabun','','THSarabun.php');//ธรรมดา
$pdf->SetFont('THSarabun','',13);

$h=7;


//$pdf->SetXY(25,4+$h*1);
$pdf->SetLeftMargin(18);
$pdf->Write(5,'(10) ผู้ประเมินและผู้รับการประเมิน ได้ตกลงร่วมกันและเห็นพ้องกันแล้ว (ระบุข้อมูลใน (1) และหรือ (3) และหรือ (5) ตามระดับสมรรถนะของตำแหน่งที่กำหนดให้ครบ) จึงลงลายมือชื่อไว้เป็นหลักฐาน (ลงนามเมื่อจัดทำข้อตกลง)');
//$pdf->SetMargins(1,1,200);


$pdf->SetXY(15,4+$h*3);
$pdf->Write(10,'           ลายมือชื่อ………………………………………………………………(ผู้ประเมิน)                      ลายมือชื่อ………………………………………………………………(ผู้รับการประเมิน)                     ');
$pdf->SetXY(15,4+$h*4);
$pdf->Write(10,'             วันที่………….เดือน……………………………………..พ.ศ………………………                          วันที่………….เดือน……………………………………..พ.ศ………………………');

$pdf->SetXY(15,4+$h*7);
$pdf->Write(10,'   (11) ความเห็นเพิ่มเติมของผู้ประเมิน (ระบุข้อมูลเมื่อสิ้นรอบการประเมิน) ');
$pdf->SetXY(15,4+$h*8);
$pdf->Write(10,'              1) จุดเด่น และ/หรือ สิ่งที่ควรปรับปรุงแก้ไข    ………………………………………...….….….………...…………………………………...……………………………………......…………………………………………………………......……………………');
$pdf->SetXY(15,4+$h*9);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*10);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*11);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*12);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*13);
$pdf->Write(10,'              2) ข้อเสนอแนะเกี่ยวกับวิธีส่งเสริมและพัฒนา เพื่อจัดทำแผนพัฒนารายบุคคล   ….……...….….….………...…………………………………...………......……………………....................………………………………......……………………');
$pdf->SetXY(15,4+$h*14);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*15);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*16);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');
$pdf->SetXY(15,4+$h*17);
$pdf->Write(10,'        …………………………………………...….….….………...…………………………………...……………………………………......……………………………………………………………………………………………………………………..…………......…………………… ');


$pdf->SetXY(15,4+$h*19);
$pdf->Write(10,'   (12) ผู้ประเมินและผู้รับการประเมิน ได้เห็นชอบผลการประเมินแล้ว (ระบุข้อมูลใน (2) และหรือ (4) และหรือ (6) (7) (8) (9) และ (11) ให้ครบ) จึงลงลายมือชื่อไว้เป็นหลักฐาน  (ลงนามเมื่อสิ้นรอบการประเมิน)');
$pdf->SetXY(15,4+$h*21);
$pdf->Write(10,'           ลายมือชื่อ………………………………………………………………(ผู้ประเมิน)                      ลายมือชื่อ………………………………………………………………(ผู้รับการประเมิน)                     ');
$pdf->SetXY(15,4+$h*22);
$pdf->Write(10,'             วันที่………….เดือน……………………………………..พ.ศ………………………                          วันที่………….เดือน……………………………………..พ.ศ………………………');


$pdf->SetXY(130,189);
$pdf->Write(0,'หน้าที่  2 จาก 2 หน้า');//. $narray.' array');

$pdf->Output();

?>